"""
`bambucommands` contains all the internal command structures that are used by `BambuPrinter` to interact 
with your printer.  They are not documented but can be found [here](https://github.com/synman/bambu-printer-manager/blob/main/src/bpm/bambucommands.py).
"""
ANNOUNCE_PUSH = {
    "pushing": {
        "command": "pushall",
        "push_target": 1,
        "sequence_id": "0",
        "version": 1
    }
}

ANNOUNCE_VERSION = {
    "info": {
        "command": "get_version",
        "sequence_id": "0"
    }
}

CHAMBER_LIGHT_TOGGLE = {
    "system": {
        "sequence_id": "0",
        "command": "ledctrl",
        "led_node": "chamber_light",
        "led_mode": "on",
        "led_on_time": 500,
        "led_off_time": 500,
        "loop_times": 0,
        "interval_time": 0
    }
}

SPEED_PROFILE_TEMPLATE = {
    "print": {
        "sequence_id": "0",
        "command": "print_speed",
        "param": "2"
    }
}

X1_FLOWRATE_CALI_RESULTS = {
    "print": {
        "sequence_id": "0",
        "command": "flowrate_get_result"
    }
}

X1_EXTRUSION_CALI_RESULTS = {
    "print": {
        "sequence_id": "0",
        "command": "extrusion_cali_get_result"
    }
}

EXTRUSION_CALI = {
    "print": {
        "sequence_id": "0",
        "command": "extrusion_cali",
        "tray_id": 0,
        "nozzle_temp": 250,
        "bed_temp": 65,
        "max_volumetric_speed": 22,
    }
}

EXTRUSION_CALI_SET = {
    "print": {
        "sequence_id": "0",
        "command": "extrusion_cali_set",
        "tray_id": 0,
        "k_value": 0.020,
    }
}

PRINT_OPTION_COMMAND = {
    "print": {
        "command": "print_option",
        "sequence_id": "0"
    }
}

PAUSE_PRINT = {
    "print": {
        "sequence_id": "0",
        "command": "pause"
    }
}

RESUME_PRINT = {
    "print": {
        "sequence_id": "0",
        "command": "resume"
    }
}

STOP_PRINT = {
    "print": {
        "sequence_id": "0",
        "command": "stop"
    }
}

SEND_GCODE_TEMPLATE = {
    "print": {
        "sequence_id": "0",
        "command": "gcode_line",
        "param": ""
    }
}

UNLOAD_FILAMENT = {
    "print": {
        "sequence_id": "0",
        "command": "unload_filament"
    }
}

AMS_FILAMENT_CHANGE = {
    "print": {
        "sequence_id": "0",
        "command": "ams_change_filament",
        "target": 0,
        "curr_temp": 250,
        "tar_temp": 250
    }
}

AMS_FILAMENT_SETTING = {
    "print": {
        "command": "ams_filament_setting",
        "ams_id": 255,
        "tray_id": 254,
        "tray_info_idx": "",
        "sequence_id": "0",
    }
}

AMS_USER_SETTING = {
    "print": {
        "ams_id": 0,
        "command": "ams_user_setting",
        "sequence_id": "0",
        "calibrate_remain_flag": True,
        "startup_read_option": True,
        "tray_read_option": True
    }
}

AMS_CONTROL = {
    "print": {
        "sequence_id": "0",
        "command": "ams_control",
        "param": "resume"  # "resume", "reset" or "pause"
    }
}

PRINT_3MF_FILE = {
    "print": {
        "command": "project_file",
        "sequence_id": "0",
        "use_ams": False,
        "ams_mapping": "",
        "bed_type": "auto",
        "url": "file:///sdcard/Oreo.gcode.3mf",
        "file": "Oreo.gcode.3mf",
        "param": "Metadata/plate_#.gcode",
        "md5": "",
        "profile_id": "0",
        "project_id": "0",
        "subtask_id": "0",
        "subtask_name": "Oreo",
        "task_id": "0",
        "timelapse": False,
        "bed_leveling": True,
        "flow_cali": True,
        "layer_inspect": True,
        "vibration_cali": True
    }
}

SKIP_OBJECTS = {
    "print": {
        "sequence_id": "0",
        "command": "skip_objects",
        "obj_list": [],
    }
}

# X1 only currently
GET_ACCESSORIES = {"system": {"sequence_id": "0", "command": "get_accessories", "accessory_type": "none"}}

HMS_STATUS = {
    "result": 0,
    "t": 1699198652,
    "ver": 202311050300,
    "data": {
        "device_hms": {
            "ver": 202311050300,
            "ch": [
                {
                    'ecode': '0300910000010003',
                    'intro': '腔温加热器1温控异常，加热器过温。'
                }, {
                    'ecode': ' 0300920000010003',
                    'intro': '腔温加热器1温控异常，加热器过温。'
                }, {
                    'ecode': '0300910000010001',
                    'intro': '腔温加热器1温控异常，加热器可能短路。'
                }, {
                    'ecode': ' 0300920000010001',
                    'intro': '腔温加热器1温控异常，加热器可能短路。'
                }, {
                    'ecode': '0300910000010002',
                    'intro': '腔温加热器1温控异常，加热器可能开路或热保险丝断开。'
                }, {
                    'ecode': ' 0300920000010002',
                    'intro': '腔温加热器1温控异常，加热器可能开路或热保险丝断开。'
                }, {
                    'ecode': '0300910000010006',
                    'intro': '腔温加热器1温控异常，温度传感器可能短路。'
                }, {
                    'ecode': ' 0300920000010006',
                    'intro': '腔温加热器1温控异常，温度传感器可能短路。'
                }, {
                    'ecode': '0300910000010007',
                    'intro': '腔温加热器1温控异常，温度传感器可能开路。'
                }, {
                    'ecode': ' 0300920000010007',
                    'intro': '腔温加热器1温控异常，温度传感器可能开路。'
                }, {
                    'ecode': '0300930000010003',
                    'intro': '腔温异常，出风口温度传感器可能短路。'
                }, {
                    'ecode': '0300930000010004',
                    'intro': '腔温异常，出风口温度传感器可能开路。'
                }, {
                    'ecode': '0300930000010007',
                    'intro': '腔温异常，电源温度传感器可能短路。'
                }, {
                    'ecode': '0300930000010008',
                    'intro': '腔温异常，电源温度传感器可能开路。'
                }, {
                    'ecode': '0300930000010001',
                    'intro': '腔温异常，加热器温度传感器可能短路。'
                }, {
                    'ecode': '0300930000010002',
                    'intro': '腔温异常，加热器温度传感器可能开路。'
                }, {
                    'ecode': '0300930000010005',
                    'intro': '腔温异常，进风口温度传感器可能短路。'
                }, {
                    'ecode': '0300930000010006',
                    'intro': '腔温异常，进风口温度传感器可能开路。'
                }, {
                    'ecode': '0300940000030001',
                    'intro': '腔体散热可能过慢。如腔内气体无害，可开箱辅助散热。'
                }, {
                    'ecode': '0300180000010001',
                    'intro': '挤出力传感器数值过低，可能没有安装喷嘴。'
                }, {
                    'ecode': '0300180000010002',
                    'intro': '挤出力传感器灵敏度偏低，可能喷嘴未安装到位。'
                }, {
                    'ecode': '0300180000010003',
                    'intro': '无法读取挤出力传感器数据，MC和TH之间的连接可能断开或传感器损坏。'
                }, {
                    'ecode': '0300180000010004',
                    'intro': '挤出力传感器数据异常，可能传感器开路或者TH板异常。'
                }, {
                    'ecode': '0300180000010005',
                    'intro': None
                }, {
                    'ecode': '03001A0000020001',
                    'intro': '喷嘴被耗材包裹或热床放歪。'
                }, {
                    'ecode': '03001A0000020002',
                    'intro': '挤出力传感器检测到喷嘴堵塞。'
                }, {
                    'ecode': '03001D0000010001',
                    'intro': '挤出电机位置传感器异常，可能是传感器排线松动。'
                }, {
                    'ecode': '0C00010000010001',
                    'intro': '微型激光雷达相机离线。'
                }, {
                    'ecode': '0C00010000020002',
                    'intro': '微型激光雷达相机发生故障。'
                }, {
                    'ecode': '0C00010000010003',
                    'intro': '微型激光雷达同步异常。'
                }, {
                    'ecode': '0C00010000010004',
                    'intro': '微型激光雷达镜头脏污。'
                }, {
                    'ecode': '0C00010000010005',
                    'intro': '微型激光雷达OTP参数异常。'
                }, {
                    'ecode': '0C00010000020006',
                    'intro': '激光雷达相机外参异常，请在下次打印时开启流量校准。'
                }, {
                    'ecode': '0C00010000020007',
                    'intro': '微型激光雷达激光参数漂移。'
                }, {
                    'ecode': '0C00010000020008',
                    'intro': '机箱摄像头离线。'
                }, {
                    'ecode': '0C00010000010009',
                    'intro': '机箱摄像头镜头脏污。'
                }, {
                    'ecode': '0C0001000001000A',
                    'intro': '激光雷达LED灯可能坏了。'
                }, {
                    'ecode': '0C0001000001000B',
                    'intro': '激光雷达校准失败。'
                }, {
                    'ecode': '0C00020000010001',
                    'intro': '激光不亮。'
                }, {
                    'ecode': '0C00020000020002',
                    'intro': '激光过粗。'
                }, {
                    'ecode': '0C00020000020003',
                    'intro': '激光不够亮。'
                }, {
                    'ecode': '0C00020000020004',
                    'intro': '喷嘴太低。'
                }, {
                    'ecode': '0C00020000010005',
                    'intro': '检测到新的微型激光雷达。'
                }, {
                    'ecode': '0C00020000020006',
                    'intro': '喷嘴太高。'
                }, {
                    'ecode': '0C00030000020001',
                    'intro': '由于该材料的反光太弱，料线自动测光失败，本次首层质量检查可能不准确。'
                }, {
                    'ecode': '0C00030000020002',
                    'intro': '由于激光雷达数据异常，首层检测终止。'
                }, {
                    'ecode': '0C00030000020004',
                    'intro': '当前打印模式暂不支持首层质量检查。'
                }, {
                    'ecode': '0C00030000020005',
                    'intro': '首层检测超时。'
                }, {
                    'ecode': '0C00030000030006',
                    'intro': '冲刷的耗材堆积。'
                }, {
                    'ecode': '0C00030000030007',
                    'intro': '可能存在首层缺陷。'
                }, {
                    'ecode': '0C00030000030008',
                    'intro': '可能发生炒面缺陷。'
                }, {
                    'ecode': '0C00030000010009',
                    'intro': '首层检测模块重启。'
                }, {
                    'ecode': '0C0003000003000B',
                    'intro': '首层检查中。'
                }, {
                    'ecode': '0C0003000002000C',
                    'intro': '没有检测到打印板定位标记，请检查打印板是否正确放置。'
                }, {
                    'ecode': '0500010000020001',
                    'intro': '媒体管道出现故障。'
                }, {
                    'ecode': '0500010000020002',
                    'intro': 'USB摄像头未连接。'
                }, {
                    'ecode': '0500010000020003',
                    'intro': 'USB 摄像头出现故障。'
                }, {
                    'ecode': '0500010000030004',
                    'intro': 'SD 卡空间不足。'
                }, {
                    'ecode': '0500010000030005',
                    'intro': 'SD卡错误。'
                }, {
                    'ecode': '0500010000030006',
                    'intro': 'SD 卡未格式化。'
                }, {
                    'ecode': '0500020000020001',
                    'intro': '设备连接服务器失败，请检查网络连接。'
                }, {
                    'ecode': ' 0500020000020002',
                    'intro': '设备连接服务器失败，请检查网络连接。'
                }, {
                    'ecode': ' 0500020000020003',
                    'intro': '设备连接服务器失败，请检查网络连接。'
                }, {
                    'ecode': ' 0500020000020005',
                    'intro': '设备连接服务器失败，请检查网络连接。'
                }, {
                    'ecode': '0500020000020002',
                    'intro': '登录设备失败。'
                }, {
                    'ecode': '0500020000020004',
                    'intro': '未经授权的用户。'
                }, {
                    'ecode': '0500020000020006',
                    'intro': '实时视频服务出现故障。'
                }, {
                    'ecode': '0500020000020008',
                    'intro': '时间同步失败。'
                }, {
                    'ecode': '0500030000010001',
                    'intro': 'MC模块出现故障，请重新启动设备。'
                }, {
                    'ecode': '0500030000010002',
                    'intro': '工具头发生故障，请重新启动设备。'
                }, {
                    'ecode': '0500030000010003',
                    'intro': 'AMS模块工作异常，请尝试重启设备。'
                }, {
                    'ecode': '050003000001000A',
                    'intro': '系统状态异常，请恢复出厂设置。'
                }, {
                    'ecode': '050003000001000B',
                    'intro': '屏幕出现故障。'
                }, {
                    'ecode': '0500030000010021',
                    'intro': '硬件不兼容，请检查激光器。'
                }, {
                    'ecode': '050003000002000C',
                    'intro': '无线硬件错误：请关闭/打开 WiFi 或者重新启动设备。'
                }, {
                    'ecode': '0500040000010001',
                    'intro': '打印作业下载失败，请检查您的网络连接。'
                }, {
                    'ecode': '0500040000010002',
                    'intro': '打印状态报告失败，请检查您的网络连接。'
                }, {
                    'ecode': '0500040000010003',
                    'intro': '打印文件内容无法读取，请重新发送打印作业。'
                }, {
                    'ecode': '0500040000010004',
                    'intro': '打印文件未授权。'
                }, {
                    'ecode': '0500040000010006',
                    'intro': '无法恢复之前的打印任务。'
                }, {
                    'ecode': '0500040000020007',
                    'intro': '热床温度超过了耗材丝的软化温度，可能造成堵塞。请保持打印机的前门打开或者降低热床温度。'
                }, {
                    'ecode': '0700010000010001',
                    'intro': 'AMS1 助力电机打滑，可能挤出轮磨损或料线过细。'
                }, {
                    'ecode': '0700010000010003',
                    'intro': 'AMS1 助力电机扭矩控制异常，可能是电流传感器故障。'
                }, {
                    'ecode': '0700010000010004',
                    'intro': 'AMS1 助力电机转速控制异常，可能是转速传感器故障。'
                }, {
                    'ecode': '0700010000020002',
                    'intro': 'AMS1 助力电机过载，可能供料路径阻力大或料线缠绕。'
                }, {
                    'ecode': ' 0701010000020002',
                    'intro': 'AMS1 助力电机过载，可能供料路径阻力大或料线缠绕。'
                }, {
                    'ecode': ' 0702010000020002',
                    'intro': 'AMS1 助力电机过载，可能供料路径阻力大或料线缠绕。'
                }, {
                    'ecode': ' 0703010000020002',
                    'intro': 'AMS1 助力电机过载，可能供料路径阻力大或料线缠绕。'
                }, {
                    'ecode': '0700020000010001',
                    'intro': 'AMS1 料线速度与长度计算错误，可能是里程轮传感器故障。'
                }, {
                    'ecode': '0700200000020001',
                    'intro': 'AMS 1号槽料线耗尽。'
                }, {
                    'ecode': ' 0700210000020001',
                    'intro': 'AMS 1号槽料线耗尽。'
                }, {
                    'ecode': ' 0700220000020001',
                    'intro': 'AMS 1号槽料线耗尽。'
                }, {
                    'ecode': ' 0700230000020001',
                    'intro': 'AMS 1号槽料线耗尽。'
                }, {
                    'ecode': ' 0701200000020001',
                    'intro': 'AMS 1号槽料线耗尽。'
                }, {
                    'ecode': ' 0701210000020001',
                    'intro': 'AMS 1号槽料线耗尽。'
                }, {
                    'ecode': ' 0701220000020001',
                    'intro': 'AMS 1号槽料线耗尽。'
                }, {
                    'ecode': '\xa00701230000020001',
                    'intro': 'AMS 1号槽料线耗尽。'
                }, {
                    'ecode': ' 0702200000020001',
                    'intro': 'AMS 1号槽料线耗尽。'
                }, {
                    'ecode': ' 0702210000020001',
                    'intro': 'AMS 1号槽料线耗尽。'
                }, {
                    'ecode': ' 0702220000020001',
                    'intro': 'AMS 1号槽料线耗尽。'
                }, {
                    'ecode': ' 0702230000020001',
                    'intro': 'AMS 1号槽料线耗尽。'
                }, {
                    'ecode': ' 0703200000020001',
                    'intro': 'AMS 1号槽料线耗尽。'
                }, {
                    'ecode': ' 0703210000020001',
                    'intro': 'AMS 1号槽料线耗尽。'
                }, {
                    'ecode': ' 0703220000020001',
                    'intro': 'AMS 1号槽料线耗尽。'
                }, {
                    'ecode': ' 0703230000020001',
                    'intro': 'AMS 1号槽料线耗尽。'
                }, {
                    'ecode': '0700200000020002',
                    'intro': 'AMS 1号料槽为空。'
                }, {
                    'ecode': ' 0700210000020002',
                    'intro': 'AMS 1号料槽为空。'
                }, {
                    'ecode': ' 0700220000020002',
                    'intro': 'AMS 1号料槽为空。'
                }, {
                    'ecode': ' 0700230000020002',
                    'intro': 'AMS 1号料槽为空。'
                }, {
                    'ecode': ' 0701200000020002',
                    'intro': 'AMS 1号料槽为空。'
                }, {
                    'ecode': ' 0701210000020002',
                    'intro': 'AMS 1号料槽为空。'
                }, {
                    'ecode': ' 0701220000020002',
                    'intro': 'AMS 1号料槽为空。'
                }, {
                    'ecode': '\xa00701230000020002',
                    'intro': 'AMS 1号料槽为空。'
                }, {
                    'ecode': ' 0702200000020002',
                    'intro': 'AMS 1号料槽为空。'
                }, {
                    'ecode': ' 0702210000020002',
                    'intro': 'AMS 1号料槽为空。'
                }, {
                    'ecode': ' 0702220000020002',
                    'intro': 'AMS 1号料槽为空。'
                }, {
                    'ecode': ' 0702230000020002',
                    'intro': 'AMS 1号料槽为空。'
                }, {
                    'ecode': ' 0703200000020002',
                    'intro': 'AMS 1号料槽为空。'
                }, {
                    'ecode': ' 0703210000020002',
                    'intro': 'AMS 1号料槽为空。'
                }, {
                    'ecode': ' 0703220000020002',
                    'intro': 'AMS 1号料槽为空。'
                }, {
                    'ecode': ' 0703230000020002',
                    'intro': 'AMS 1号料槽为空。'
                }, {
                    'ecode': '0700200000020003',
                    'intro': 'AMS 1号料槽的料线可能断裂在AMS内。'
                }, {
                    'ecode': ' 0700210000020003',
                    'intro': 'AMS 1号料槽的料线可能断裂在AMS内。'
                }, {
                    'ecode': ' 0700220000020003',
                    'intro': 'AMS 1号料槽的料线可能断裂在AMS内。'
                }, {
                    'ecode': ' 0700230000020003',
                    'intro': 'AMS 1号料槽的料线可能断裂在AMS内。'
                }, {
                    'ecode': ' 0701200000020003',
                    'intro': 'AMS 1号料槽的料线可能断裂在AMS内。'
                }, {
                    'ecode': ' 0701210000020003',
                    'intro': 'AMS 1号料槽的料线可能断裂在AMS内。'
                }, {
                    'ecode': ' 0701220000020003',
                    'intro': 'AMS 1号料槽的料线可能断裂在AMS内。'
                }, {
                    'ecode': '\xa00701230000020003',
                    'intro': 'AMS 1号料槽的料线可能断裂在AMS内。'
                }, {
                    'ecode': ' 0702200000020003',
                    'intro': 'AMS 1号料槽的料线可能断裂在AMS内。'
                }, {
                    'ecode': ' 0702210000020003',
                    'intro': 'AMS 1号料槽的料线可能断裂在AMS内。'
                }, {
                    'ecode': ' 0702220000020003',
                    'intro': 'AMS 1号料槽的料线可能断裂在AMS内。'
                }, {
                    'ecode': ' 0702230000020003',
                    'intro': 'AMS 1号料槽的料线可能断裂在AMS内。'
                }, {
                    'ecode': ' 0703200000020003',
                    'intro': 'AMS 1号料槽的料线可能断裂在AMS内。'
                }, {
                    'ecode': ' 0703210000020003',
                    'intro': 'AMS 1号料槽的料线可能断裂在AMS内。'
                }, {
                    'ecode': ' 0703220000020003',
                    'intro': 'AMS 1号料槽的料线可能断裂在AMS内。'
                }, {
                    'ecode': ' 0703230000020003',
                    'intro': 'AMS 1号料槽的料线可能断裂在AMS内。'
                }, {
                    'ecode': '0700200000020004',
                    'intro': 'AMS1 料槽1料线可能断在工具头。'
                }, {
                    'ecode': ' 0700210000020004',
                    'intro': 'AMS1 料槽1料线可能断在工具头。'
                }, {
                    'ecode': ' 0700220000020004',
                    'intro': 'AMS1 料槽1料线可能断在工具头。'
                }, {
                    'ecode': ' 0700230000020004',
                    'intro': 'AMS1 料槽1料线可能断在工具头。'
                }, {
                    'ecode': ' 0701200000020004',
                    'intro': 'AMS1 料槽1料线可能断在工具头。'
                }, {
                    'ecode': ' 0701210000020004',
                    'intro': 'AMS1 料槽1料线可能断在工具头。'
                }, {
                    'ecode': ' 0701220000020004',
                    'intro': 'AMS1 料槽1料线可能断在工具头。'
                }, {
                    'ecode': '\xa00701230000020004',
                    'intro': 'AMS1 料槽1料线可能断在工具头。'
                }, {
                    'ecode': ' 0702200000020004',
                    'intro': 'AMS1 料槽1料线可能断在工具头。'
                }, {
                    'ecode': ' 0702210000020004',
                    'intro': 'AMS1 料槽1料线可能断在工具头。'
                }, {
                    'ecode': ' 0702220000020004',
                    'intro': 'AMS1 料槽1料线可能断在工具头。'
                }, {
                    'ecode': ' 0702230000020004',
                    'intro': 'AMS1 料槽1料线可能断在工具头。'
                }, {
                    'ecode': ' 0703200000020004',
                    'intro': 'AMS1 料槽1料线可能断在工具头。'
                }, {
                    'ecode': ' 0703210000020004',
                    'intro': 'AMS1 料槽1料线可能断在工具头。'
                }, {
                    'ecode': ' 0703220000020004',
                    'intro': 'AMS1 料槽1料线可能断在工具头。'
                }, {
                    'ecode': ' 0703230000020004',
                    'intro': 'AMS1 料槽1料线可能断在工具头。'
                }, {
                    'ecode': '0700200000020005',
                    'intro': 'AMS1 料槽1料线用完，冲刷旧料异常，请检查料线是否卡在工具头。'
                }, {
                    'ecode': ' 0700210000020005',
                    'intro': 'AMS1 料槽1料线用完，冲刷旧料异常，请检查料线是否卡在工具头。'
                }, {
                    'ecode': ' 0700220000020005',
                    'intro': 'AMS1 料槽1料线用完，冲刷旧料异常，请检查料线是否卡在工具头。'
                }, {
                    'ecode': ' 0700230000020005',
                    'intro': 'AMS1 料槽1料线用完，冲刷旧料异常，请检查料线是否卡在工具头。'
                }, {
                    'ecode': ' 0701200000020005',
                    'intro': 'AMS1 料槽1料线用完，冲刷旧料异常，请检查料线是否卡在工具头。'
                }, {
                    'ecode': ' 0701210000020005',
                    'intro': 'AMS1 料槽1料线用完，冲刷旧料异常，请检查料线是否卡在工具头。'
                }, {
                    'ecode': ' 0701220000020005',
                    'intro': 'AMS1 料槽1料线用完，冲刷旧料异常，请检查料线是否卡在工具头。'
                }, {
                    'ecode': '\xa00701230000020005',
                    'intro': 'AMS1 料槽1料线用完，冲刷旧料异常，请检查料线是否卡在工具头。'
                }, {
                    'ecode': ' 0702200000020005',
                    'intro': 'AMS1 料槽1料线用完，冲刷旧料异常，请检查料线是否卡在工具头。'
                }, {
                    'ecode': ' 0702210000020005',
                    'intro': 'AMS1 料槽1料线用完，冲刷旧料异常，请检查料线是否卡在工具头。'
                }, {
                    'ecode': ' 0702220000020005',
                    'intro': 'AMS1 料槽1料线用完，冲刷旧料异常，请检查料线是否卡在工具头。'
                }, {
                    'ecode': ' 0702230000020005',
                    'intro': 'AMS1 料槽1料线用完，冲刷旧料异常，请检查料线是否卡在工具头。'
                }, {
                    'ecode': ' 0703200000020005',
                    'intro': 'AMS1 料槽1料线用完，冲刷旧料异常，请检查料线是否卡在工具头。'
                }, {
                    'ecode': ' 0703210000020005',
                    'intro': 'AMS1 料槽1料线用完，冲刷旧料异常，请检查料线是否卡在工具头。'
                }, {
                    'ecode': ' 0703220000020005',
                    'intro': 'AMS1 料槽1料线用完，冲刷旧料异常，请检查料线是否卡在工具头。'
                }, {
                    'ecode': ' 0703230000020005',
                    'intro': 'AMS1 料槽1料线用完，冲刷旧料异常，请检查料线是否卡在工具头。'
                }, {
                    'ecode': '0700200000020006',
                    'intro': '检测到送料过程中特氟龙管断开，请检查从AMS到挤出机的特氟龙管是否接好。'
                }, {
                    'ecode': ' 0701200000020006',
                    'intro': '检测到送料过程中特氟龙管断开，请检查从AMS到挤出机的特氟龙管是否接好。'
                }, {
                    'ecode': ' 0702200000020006',
                    'intro': '检测到送料过程中特氟龙管断开，请检查从AMS到挤出机的特氟龙管是否接好。'
                }, {
                    'ecode': ' 0703200000020006',
                    'intro': '检测到送料过程中特氟龙管断开，请检查从AMS到挤出机的特氟龙管是否接好。'
                }, {
                    'ecode': '0700200000030001',
                    'intro': 'AMS 1号料槽料线已用完。请稍候，正在冲刷旧料线。'
                }, {
                    'ecode': ' 0700210000030001',
                    'intro': 'AMS 1号料槽料线已用完。请稍候，正在冲刷旧料线。'
                }, {
                    'ecode': ' 0700220000030001',
                    'intro': 'AMS 1号料槽料线已用完。请稍候，正在冲刷旧料线。'
                }, {
                    'ecode': ' 0700230000030001',
                    'intro': 'AMS 1号料槽料线已用完。请稍候，正在冲刷旧料线。'
                }, {
                    'ecode': ' 0701200000030001',
                    'intro': 'AMS 1号料槽料线已用完。请稍候，正在冲刷旧料线。'
                }, {
                    'ecode': ' 0701210000030001',
                    'intro': 'AMS 1号料槽料线已用完。请稍候，正在冲刷旧料线。'
                }, {
                    'ecode': ' 0701220000030001;0701230000030001',
                    'intro': 'AMS 1号料槽料线已用完。请稍候，正在冲刷旧料线。'
                }, {
                    'ecode': ' 0702200000030001',
                    'intro': 'AMS 1号料槽料线已用完。请稍候，正在冲刷旧料线。'
                }, {
                    'ecode': ' 0702210000030001',
                    'intro': 'AMS 1号料槽料线已用完。请稍候，正在冲刷旧料线。'
                }, {
                    'ecode': ' 0702220000030001',
                    'intro': 'AMS 1号料槽料线已用完。请稍候，正在冲刷旧料线。'
                }, {
                    'ecode': ' 0702230000030001',
                    'intro': 'AMS 1号料槽料线已用完。请稍候，正在冲刷旧料线。'
                }, {
                    'ecode': ' 0703200000030001',
                    'intro': 'AMS 1号料槽料线已用完。请稍候，正在冲刷旧料线。'
                }, {
                    'ecode': ' 0703210000030001',
                    'intro': 'AMS 1号料槽料线已用完。请稍候，正在冲刷旧料线。'
                }, {
                    'ecode': ' 0703220000030001',
                    'intro': 'AMS 1号料槽料线已用完。请稍候，正在冲刷旧料线。'
                }, {
                    'ecode': ' 0703230000030001',
                    'intro': 'AMS 1号料槽料线已用完。请稍候，正在冲刷旧料线。'
                }, {
                    'ecode': '0700200000030002',
                    'intro': 'AMS1 1号槽料线用完，已自动切换到具有相同料线的插槽。'
                }, {
                    'ecode': ' 0700210000030002',
                    'intro': 'AMS1 1号槽料线用完，已自动切换到具有相同料线的插槽。'
                }, {
                    'ecode': ' 0700220000030002',
                    'intro': 'AMS1 1号槽料线用完，已自动切换到具有相同料线的插槽。'
                }, {
                    'ecode': ' 0700230000030002',
                    'intro': 'AMS1 1号槽料线用完，已自动切换到具有相同料线的插槽。'
                }, {
                    'ecode': ' 0701200000030002',
                    'intro': 'AMS1 1号槽料线用完，已自动切换到具有相同料线的插槽。'
                }, {
                    'ecode': ' 0701210000030002',
                    'intro': 'AMS1 1号槽料线用完，已自动切换到具有相同料线的插槽。'
                }, {
                    'ecode': ' 0701220000030002;0701230000030002',
                    'intro': 'AMS1 1号槽料线用完，已自动切换到具有相同料线的插槽。'
                }, {
                    'ecode': ' 0702200000030002',
                    'intro': 'AMS1 1号槽料线用完，已自动切换到具有相同料线的插槽。'
                }, {
                    'ecode': ' 0702210000030002',
                    'intro': 'AMS1 1号槽料线用完，已自动切换到具有相同料线的插槽。'
                }, {
                    'ecode': ' 0702220000030002',
                    'intro': 'AMS1 1号槽料线用完，已自动切换到具有相同料线的插槽。'
                }, {
                    'ecode': ' 0702230000030002',
                    'intro': 'AMS1 1号槽料线用完，已自动切换到具有相同料线的插槽。'
                }, {
                    'ecode': ' 0703200000030002',
                    'intro': 'AMS1 1号槽料线用完，已自动切换到具有相同料线的插槽。'
                }, {
                    'ecode': ' 0703210000030002',
                    'intro': 'AMS1 1号槽料线用完，已自动切换到具有相同料线的插槽。'
                }, {
                    'ecode': ' 0703220000030002',
                    'intro': 'AMS1 1号槽料线用完，已自动切换到具有相同料线的插槽。'
                }, {
                    'ecode': ' 0703230000030002',
                    'intro': 'AMS1 1号槽料线用完，已自动切换到具有相同料线的插槽。'
                }, {
                    'ecode': '0700400000020001',
                    'intro': '料线缓冲信号丢失，电缆或信号传感器可能出现故障。'
                }, {
                    'ecode': '0700400000020002',
                    'intro': '缓冲区位置信号异常，可能位置传感器异常。'
                }, {
                    'ecode': '0700400000020003',
                    'intro': '多通缓冲通信异常，可能连接线异常。'
                }, {
                    'ecode': '0700400000020004',
                    'intro': '缓冲区信号异常，弹簧可能被卡住了。'
                }, {
                    'ecode': '0700450000020001',
                    'intro': '切料传感器异常。请检查连接器是否正确插入。'
                }, {
                    'ecode': '0700450000020002',
                    'intro': '料线切刀切割距离过大，XY电机可能会丢步。'
                }, {
                    'ecode': '0700450000020003',
                    'intro': '切刀刀柄未松开，刀柄或刀片可能被卡住，或料线霍尔接线异常。'
                }, {
                    'ecode': '0700500000020001',
                    'intro': 'AMS1 通信异常，请检查AMS的连接线。'
                }, {
                    'ecode': '0700510000030001',
                    'intro': 'AMS已禁用，请从料盘支架加载耗材。'
                }, {
                    'ecode': '0700600000020001',
                    'intro': 'AMS 1号槽电机过载，料线可能缠料或料盘卡住。'
                }, {
                    'ecode': ' 0700610000020001',
                    'intro': 'AMS 1号槽电机过载，料线可能缠料或料盘卡住。'
                }, {
                    'ecode': ' 0700620000020001',
                    'intro': 'AMS 1号槽电机过载，料线可能缠料或料盘卡住。'
                }, {
                    'ecode': ' 0700630000020001',
                    'intro': 'AMS 1号槽电机过载，料线可能缠料或料盘卡住。'
                }, {
                    'ecode': ' 0701600000020001',
                    'intro': 'AMS 1号槽电机过载，料线可能缠料或料盘卡住。'
                }, {
                    'ecode': ' 0701610000020001',
                    'intro': 'AMS 1号槽电机过载，料线可能缠料或料盘卡住。'
                }, {
                    'ecode': ' 0701620000020001',
                    'intro': 'AMS 1号槽电机过载，料线可能缠料或料盘卡住。'
                }, {
                    'ecode': '\xa00701630000020001',
                    'intro': 'AMS 1号槽电机过载，料线可能缠料或料盘卡住。'
                }, {
                    'ecode': ' 0702600000020001',
                    'intro': 'AMS 1号槽电机过载，料线可能缠料或料盘卡住。'
                }, {
                    'ecode': ' 0702610000020001',
                    'intro': 'AMS 1号槽电机过载，料线可能缠料或料盘卡住。'
                }, {
                    'ecode': ' 0702620000020001',
                    'intro': 'AMS 1号槽电机过载，料线可能缠料或料盘卡住。'
                }, {
                    'ecode': ' 0702630000020001',
                    'intro': 'AMS 1号槽电机过载，料线可能缠料或料盘卡住。'
                }, {
                    'ecode': ' 0703600000020001',
                    'intro': 'AMS 1号槽电机过载，料线可能缠料或料盘卡住。'
                }, {
                    'ecode': ' 0703610000020001',
                    'intro': 'AMS 1号槽电机过载，料线可能缠料或料盘卡住。'
                }, {
                    'ecode': ' 0703620000020001',
                    'intro': 'AMS 1号槽电机过载，料线可能缠料或料盘卡住。'
                }, {
                    'ecode': ' 0703630000020001',
                    'intro': 'AMS 1号槽电机过载，料线可能缠料或料盘卡住。'
                }, {
                    'ecode': '0700700000020001',
                    'intro': '耗材退出挤出机失败，请检查是否发生堵头或者耗材是否断在挤出机内部。'
                }, {
                    'ecode': ' 0701700000020001',
                    'intro': '耗材退出挤出机失败，请检查是否发生堵头或者耗材是否断在挤出机内部。'
                }, {
                    'ecode': ' 0702700000020001',
                    'intro': '耗材退出挤出机失败，请检查是否发生堵头或者耗材是否断在挤出机内部。'
                }, {
                    'ecode': ' 0703700000020001',
                    'intro': '耗材退出挤出机失败，请检查是否发生堵头或者耗材是否断在挤出机内部。'
                }, {
                    'ecode': '0700700000020002',
                    'intro': '耗材送往挤出机失败，请检查耗材或料盘是否卡住。'
                }, {
                    'ecode': ' 0701700000020002',
                    'intro': '耗材送往挤出机失败，请检查耗材或料盘是否卡住。'
                }, {
                    'ecode': ' 0702700000020002',
                    'intro': '耗材送往挤出机失败，请检查耗材或料盘是否卡住。'
                }, {
                    'ecode': ' 0703700000020002',
                    'intro': '耗材送往挤出机失败，请检查耗材或料盘是否卡住。'
                }, {
                    'ecode': '0700700000020003',
                    'intro': '耗材挤出异常，请检查挤出机和喷嘴是否堵塞。'
                }, {
                    'ecode': ' 0701700000020003',
                    'intro': '耗材挤出异常，请检查挤出机和喷嘴是否堵塞。'
                }, {
                    'ecode': ' 0702700000020003 0703700000020003',
                    'intro': '耗材挤出异常，请检查挤出机和喷嘴是否堵塞。'
                }, {
                    'ecode': '0700700000020004',
                    'intro': '耗材从工具头退回AMS失败，请检查耗材或料盘是否卡住。'
                }, {
                    'ecode': ' 0701700000020004',
                    'intro': '耗材从工具头退回AMS失败，请检查耗材或料盘是否卡住。'
                }, {
                    'ecode': ' 0702700000020004 0703700000020004',
                    'intro': '耗材从工具头退回AMS失败，请检查耗材或料盘是否卡住。'
                }, {
                    'ecode': '0700700000020005',
                    'intro': '耗材送出AMS失败，请剪平耗材端口、检查料盘是否卡住。'
                }, {
                    'ecode': ' 0701700000020005',
                    'intro': '耗材送出AMS失败，请剪平耗材端口、检查料盘是否卡住。'
                }, {
                    'ecode': ' 0702700000020005 0703700000020005',
                    'intro': '耗材送出AMS失败，请剪平耗材端口、检查料盘是否卡住。'
                }, {
                    'ecode': '0700700000020006',
                    'intro': '检测到冲刷旧料超时，请检查耗材是否卡住或挤出机/喷嘴堵塞。'
                }, {
                    'ecode': ' 0701700000020006',
                    'intro': '检测到冲刷旧料超时，请检查耗材是否卡住或挤出机/喷嘴堵塞。'
                }, {
                    'ecode': ' 0702700000020006 0703700000020006',
                    'intro': '检测到冲刷旧料超时，请检查耗材是否卡住或挤出机/喷嘴堵塞。'
                }, {
                    'ecode': '0700700000020007',
                    'intro': 'AMS耗材用尽。请把耗材放入同一个AMS槽位后继续。'
                }, {
                    'ecode': ' 0701700000020007',
                    'intro': 'AMS耗材用尽。请把耗材放入同一个AMS槽位后继续。'
                }, {
                    'ecode': ' 0702700000020007 0703700000020007',
                    'intro': 'AMS耗材用尽。请把耗材放入同一个AMS槽位后继续。'
                }, {
                    'ecode': '0700700000020008',
                    'intro': '多次获取AMS映射表失败，请点击“继续”重试。'
                }, {
                    'ecode': ' 0701700000020008',
                    'intro': '多次获取AMS映射表失败，请点击“继续”重试。'
                }, {
                    'ecode': ' 0702700000020008 0703700000020008',
                    'intro': '多次获取AMS映射表失败，请点击“继续”重试。'
                }, {
                    'ecode': '1200100000020002',
                    'intro': 'AMS1 1号槽电机过载。料线可能缠结或卡住。'
                }, {
                    'ecode': ' 1200110000020002',
                    'intro': 'AMS1 1号槽电机过载。料线可能缠结或卡住。'
                }, {
                    'ecode': ' 1200120000020002',
                    'intro': 'AMS1 1号槽电机过载。料线可能缠结或卡住。'
                }, {
                    'ecode': ' 1200130000020002',
                    'intro': 'AMS1 1号槽电机过载。料线可能缠结或卡住。'
                }, {
                    'ecode': '1200100000010001',
                    'intro': 'AMS1 有刷电机1打滑，可能挤出轮磨损或料线过细。'
                }, {
                    'ecode': '1200110000010001',
                    'intro': 'AMS1 有刷电机1打滑，可能挤出轮磨损或料线过细。'
                }, {
                    'ecode': '1200120000010001',
                    'intro': 'AMS1 有刷电机1打滑，可能挤出轮磨损或料线过细。'
                }, {
                    'ecode': '1200130000010001',
                    'intro': 'AMS1 有刷电机1打滑，可能挤出轮磨损或料线过细。'
                }, {
                    'ecode': '1201100000010001',
                    'intro': 'AMS1 有刷电机1打滑，可能挤出轮磨损或料线过细。'
                }, {
                    'ecode': '1201110000010001',
                    'intro': 'AMS1 有刷电机1打滑，可能挤出轮磨损或料线过细。'
                }, {
                    'ecode': '1201120000010001',
                    'intro': 'AMS1 有刷电机1打滑，可能挤出轮磨损或料线过细。'
                }, {
                    'ecode': '1201130000010001',
                    'intro': 'AMS1 有刷电机1打滑，可能挤出轮磨损或料线过细。'
                }, {
                    'ecode': '1202100000010001',
                    'intro': 'AMS1 有刷电机1打滑，可能挤出轮磨损或料线过细。'
                }, {
                    'ecode': '1202110000010001',
                    'intro': 'AMS1 有刷电机1打滑，可能挤出轮磨损或料线过细。'
                }, {
                    'ecode': '1202120000010001',
                    'intro': 'AMS1 有刷电机1打滑，可能挤出轮磨损或料线过细。'
                }, {
                    'ecode': '1202130000010001',
                    'intro': 'AMS1 有刷电机1打滑，可能挤出轮磨损或料线过细。'
                }, {
                    'ecode': '1203100000010001',
                    'intro': 'AMS1 有刷电机1打滑，可能挤出轮磨损或料线过细。'
                }, {
                    'ecode': '1203110000010001',
                    'intro': 'AMS1 有刷电机1打滑，可能挤出轮磨损或料线过细。'
                }, {
                    'ecode': '1203120000010001',
                    'intro': 'AMS1 有刷电机1打滑，可能挤出轮磨损或料线过细。'
                }, {
                    'ecode': '1203130000010001',
                    'intro': 'AMS1 有刷电机1打滑，可能挤出轮磨损或料线过细。'
                }, {
                    'ecode': '1200800000020001',
                    'intro': 'AMS1 1号槽料线缠绕或者卡住。'
                }, {
                    'ecode': ' 1200810000020001',
                    'intro': 'AMS1 1号槽料线缠绕或者卡住。'
                }, {
                    'ecode': ' 1200820000020001',
                    'intro': 'AMS1 1号槽料线缠绕或者卡住。'
                }, {
                    'ecode': ' 1200830000020001',
                    'intro': 'AMS1 1号槽料线缠绕或者卡住。'
                }, {
                    'ecode': '07FF200000020001',
                    'intro': '外挂耗材用尽，请装入新的耗材丝。'
                }, {
                    'ecode': '07FF200000020002',
                    'intro': '未发现外部挂载的耗材；请装入新的耗材。'
                }, {
                    'ecode': '07FF200000020004',
                    'intro': '请将盘支架上的耗材丝拉出工具头。'
                }, {
                    'ecode': '12FF200000020007',
                    'intro': '检查工具头料线位置失败，请点击获取更多帮助。'
                }, {
                    'ecode': '1200200000020006',
                    'intro': '挤出AMS1 1号槽的料线失败，可能是挤出机堵塞，或者是料线过细，导致挤出机打滑'
                }, {
                    'ecode': ' 1200210000020006',
                    'intro': '挤出AMS1 1号槽的料线失败，可能是挤出机堵塞，或者是料线过细，导致挤出机打滑'
                }, {
                    'ecode': ' 1200220000020006',
                    'intro': '挤出AMS1 1号槽的料线失败，可能是挤出机堵塞，或者是料线过细，导致挤出机打滑'
                }, {
                    'ecode': ' 1200230000020006',
                    'intro': '挤出AMS1 1号槽的料线失败，可能是挤出机堵塞，或者是料线过细，导致挤出机打滑'
                }, {
                    'ecode': ' 1201200000020006',
                    'intro': '挤出AMS1 1号槽的料线失败，可能是挤出机堵塞，或者是料线过细，导致挤出机打滑'
                }, {
                    'ecode': ' 1201210000020006',
                    'intro': '挤出AMS1 1号槽的料线失败，可能是挤出机堵塞，或者是料线过细，导致挤出机打滑'
                }, {
                    'ecode': ' 1201220000020006',
                    'intro': '挤出AMS1 1号槽的料线失败，可能是挤出机堵塞，或者是料线过细，导致挤出机打滑'
                }, {
                    'ecode': ' 1201230000020006',
                    'intro': '挤出AMS1 1号槽的料线失败，可能是挤出机堵塞，或者是料线过细，导致挤出机打滑'
                }
            ],
            "en": [
                {
                    "ecode": "0300010000010001",
                    "intro": "热床温度异常；加热器可能短路。"
                },
                {
                    "ecode": "0300010000010002",
                    "intro": "热床温度异常；加热器可能断路，或热保护开关可能断开。"
                },
                {
                    "ecode": "0300010000010003",
                    "intro": "热床温度异常；加热器过热。"
                },
                {
                    "ecode": "0300020000010001",
                    "intro": "喷嘴温度异常；加热器可能短路。"
                },
                {
                    "ecode": "0300020000010002",
                    "intro": "喷嘴温度异常；加热器可能断路。"
                },
                {
                    "ecode": "0300020000010003",
                    "intro": "喷嘴温度异常；加热器过热。"
                },
                {
                    "ecode": "0300030000010001",
                    "intro": "喷嘴风扇转速过慢或停止。可能卡住或连接器未正确插入。"
                },
                {
                    "ecode": "0300030000020002",
                    "intro": ""
                },
                {
                    "ecode": "0300040000020001",
                    "intro": "部件冷却风扇转速过慢或停止。可能卡住或连接器未正确插入。"
                },
                {
                    "ecode": "0300050000010001",
                    "intro": "电机驱动器过热。散热器可能松动，或冷却风扇可能损坏。"
                },
                {
                    "ecode": "0300060000010001",
                    "intro": "电机A出现开路。可能连接松动，或电机可能故障。"
                },
                {
                    "ecode": "0300060000010002",
                    "intro": "电机A出现短路。可能已故障。"
                },
                {
                    "ecode": "0300070000010001",
                    "intro": "电机B出现开路。连接可能松动，或电机可能故障。"
                },
                {
                    "ecode": "0300070000010002",
                    "intro": "电机B出现短路。可能已故障。"
                },
                {
                    "ecode": "0300080000010001",
                    "intro": "电机Z出现开路。连接可能松动，或电机可能故障。"
                },
                {
                    "ecode": "0300080000010002",
                    "intro": "电机Z出现短路。可能已故障。"
                },
                {
                    "ecode": "0300090000010001",
                    "intro": "电机E出现短路。可能已故障。"
                },
                {
                    "ecode": "0300090000010002",
                    "intro": "热床力传感器1过于敏感。可能卡在应变臂与热床支撑之间，或调节螺丝可能过紧。"
                },
                {
                    "ecode": "03000A0000010001",
                    "intro": "热床力传感器1信号过弱。传感器可能损坏或电连接不良。"
                },
                {
                    "ecode": "03000A0000010002",
                    "intro": "热床力传感器1信号太弱。与传感器的电子连接可能断裂。"
                },
                {
                    "ecode": "03000A0000010003",
                    "intro": "热床力传感器1检测到外部干扰。热床板可能接触到热床外部的物体。"
                },
                {
                    "ecode": "03000A0000010004",
                    "intro": "力传感器1检测到意外的持续力量。热床可能卡住，或模拟前端可能损坏。"
                },
                {
                    "ecode": "03000A0000010005",
                    "intro": "Force sensor 1 detected unexpected continuous force. The heatbed may be stuck, or the analog front end may be broken."
                },
                {
                    "ecode": "03000B0000010001",
                    "intro": "Heatbed force sensor 2 is too sensitive. It may be stuck between the strain arm and heatbed support, or the adjusting screw may be too tight."
                },
                {
                    "ecode": "03000B0000010003",
                    "intro": "The signal of heatbed force sensor 2 is too weak. The electronic connection to the sensor may be broken."
                },
                {
                    "ecode": "03000B0000010004",
                    "intro": "An external disturbance was detected on force sensor 2. The heatbed plate may have touched something outside the heatbed."
                },
                {
                    "ecode": "03000B0000010005",
                    "intro": "Force sensor 2 detected unexpected continuous force. The heatbed may be stuck, or the analog front end may be broken."
                },
                {
                    "ecode": "03000B0000010002",
                    "intro": "The signal of heatbed force sensor 2 is weak. The force sensor may be broken or have poor electric connection."
                },
                {
                    "ecode": "03000C0000010001",
                    "intro": "Heatbed force sensor 3 is too sensitive. It may be stuck between the strain arm and heatbed support, or the adjusting screw may be too tight."
                },
                {
                    "ecode": "03000C0000010002",
                    "intro": "The signal of heatbed force sensor 3 is weak. The force sensor may be broken or have poor electric connection."
                },
                {
                    "ecode": "03000C0000010003",
                    "intro": "The signal of heatbed force sensor 3 is too weak. The electronic connection to the sensor may be broken."
                },
                {
                    "ecode": "03000C0000010004",
                    "intro": "An external disturbance was detected on force sensor 3. The heatbed plate may have touched something outside the heatbed."
                },
                {
                    "ecode": "03000C0000010005",
                    "intro": "Force sensor 3 detected unexpected continuous force. The heatbed may be stuck, or the analog front end may be broken."
                },
                {
                    "ecode": "03000D0000010002",
                    "intro": "Heatbed homing failed. The environmental vibration is too great."
                },
                {
                    "ecode": "03000D0000010003",
                    "intro": "The build plate is not placed properly. Please adjust it."
                },
                {
                    "ecode": "03000D0000010004",
                    "intro": "The build plate is not placed properly. Please adjust it."
                },
                {
                    "ecode": "03000D0000010005",
                    "intro": "The build plate is not placed properly. Please adjust it."
                },
                {
                    "ecode": "03000D0000010006",
                    "intro": "The build plate is not placed properly. Please adjust it."
                },
                {
                    "ecode": "03000D0000010007",
                    "intro": "The build plate is not placed properly. Please adjust it."
                },
                {
                    "ecode": "03000D0000010008",
                    "intro": "The build plate is not placed properly. Please adjust it."
                },
                {
                    "ecode": "03000D0000010009",
                    "intro": "The build plate is not placed properly. Please adjust it."
                },
                {
                    "ecode": "03000D000001000A",
                    "intro": "The build plate is not placed properly. Please adjust it."
                },
                {
                    "ecode": "03000D0000020001",
                    "intro": "Heatbed homing abnormal: there may be a bulge on the heatbed or the nozzle tip may not be clean."
                },
                {
                    "ecode": "03000F0000010001",
                    "intro": "The accelerometer data is unavailable. The communication connection to the tool head may be broken, or the accelerometer may be damaged."
                },
                {
                    "ecode": "0300100000020001",
                    "intro": "The resonance frequency of the X axis is low. The timing belt may be loose."
                },
                {
                    "ecode": "0300110000020001",
                    "intro": "The resonance frequency of the Y axis is low. The timing belt may be loose."
                },
                {
                    "ecode": "0300120000020001",
                    "intro": "The front cover of the toolhead fell off."
                },
                {
                    "ecode": "0500010000020001",
                    "intro": "The media pipeline is malfunctioning."
                },
                {
                    "ecode": "0500010000020002",
                    "intro": "USB camera is not connected. Please check video camera cable connection."
                },
                {
                    "ecode": "0500010000020003",
                    "intro": "USB camera is malfunctioning."
                },
                {
                    "ecode": "0500010000030004",
                    "intro": "Not enough space in MicroSD Card, please clear some space."
                },
                {
                    "ecode": "0500010000030005",
                    "intro": "MicroSD Card error: please reinsert, format or replace it."
                },
                {
                    "ecode": "0500010000030006",
                    "intro": "Unformatted MicroSD Card: please format it."
                },
                {
                    "ecode": "0500020000020001",
                    "intro": "Failed to connect internet. Please check the network connection."
                },
                {
                    "ecode": "0500020000020002",
                    "intro": "Device login failed; please check your account information."
                },
                {
                    "ecode": "0500020000020003",
                    "intro": "Failed to connect internet; please check the network connection."
                },
                {
                    "ecode": "0500020000020004",
                    "intro": "Unauthorized user: please check your account information."
                },
                {
                    "ecode": "0500020000020005",
                    "intro": "Failed to connect internet; please check the network connection."
                },
                {
                    "ecode": "0500020000020006",
                    "intro": "Liveview service is malfunctioning; please check your network connection."
                },
                {
                    "ecode": "0500020000020007",
                    "intro": "Liveview service login failed; please check your network connection."
                },
                {
                    "ecode": "0500030000010001",
                    "intro": "The MC module is malfunctioning; please restart the device or check device cable connection."
                },
                {
                    "ecode": "0500030000010002",
                    "intro": "The toolhead is malfunctioning. Please restart the device."
                },
                {
                    "ecode": "0500030000010003",
                    "intro": "The AMS module is malfunctioning. Please restart the device."
                },
                {
                    "ecode": "0500030000010004",
                    "intro": "The AHB module is malfunctioning. Please restart the device."
                },
                {
                    "ecode": "0500030000010005",
                    "intro": "Internal service is malfunctioning. Please restart the device."
                },
                {
                    "ecode": "0500030000010006",
                    "intro": "A system panic occurred. Please restart the device."
                },
                {
                    "ecode": "0500030000010008",
                    "intro": "A system hang occurred. Please restart the device."
                },
                {
                    "ecode": "0500030000010009",
                    "intro": "A system hang occurred. It has been recovered by automatic restart."
                },
                {
                    "ecode": "050003000001000a",
                    "intro": "System state is abnormal; please restore factory settings."
                },
                {
                    "ecode": "050003000001000b",
                    "intro": "The screen is malfunctioning; please restart the device."
                },
                {
                    "ecode": "050003000002000c",
                    "intro": "Wireless hardware error: please turn off/on WiFi or restart the device."
                },
                {
                    "ecode": "050003000002000d",
                    "intro": "The SD Card controller is malfunctioning."
                },
                {
                    "ecode": "0500030000030007",
                    "intro": "A system panic occurred. It has been recovered by automatic restart."
                },
                {
                    "ecode": "0500040000010001",
                    "intro": "Failed to download print job. Please check your network connection."
                },
                {
                    "ecode": "0500040000010002",
                    "intro": "Failed to report print state. Please check your network connection."
                },
                {
                    "ecode": "0500040000010003",
                    "intro": "The content of print file is unreadable. Please resend the print job."
                },
                {
                    "ecode": "0500040000010004",
                    "intro": "The print file is unauthorized."
                },
                {
                    "ecode": "0500040000010006",
                    "intro": "Failed to resume previous print."
                },
                {
                    "ecode": "0700010000010001",
                    "intro": "The AMS1 assist motor has slipped. The extrusion wheel may be worn down, or the filament may be too thin."
                },
                {
                    "ecode": "0700010000010003",
                    "intro": "The AMS1 assist motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "0700010000010004",
                    "intro": "The AMS1 assist motor speed control is malfunctioning. The speed sensor may be faulty."
                },
                {
                    "ecode": "0700010000020002",
                    "intro": "The AMS1 assist motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "0700020000010001",
                    "intro": "AMS1 Filament speed and length error: The filament odometry may be faulty."
                },
                {
                    "ecode": "0700100000010001",
                    "intro": "The AMS1 slot1 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "0700100000010003",
                    "intro": "The AMS1 slot1 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "0700100000020002",
                    "intro": "The AMS1 slot1 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "0700110000010001",
                    "intro": "The AMS1 slot2 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "0700110000010003",
                    "intro": "The AMS1 slot2 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "0700110000020002",
                    "intro": "The AMS1 slot2 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "0700120000010001",
                    "intro": "The AMS1 slot3 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "0700120000010003",
                    "intro": "The AMS1 slot3 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "0700120000020002",
                    "intro": "The AMS1 slot3 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "0700130000010001",
                    "intro": "The AMS1 slot4 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "0700130000010003",
                    "intro": "The AMS1 slot4 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "0700130000020002",
                    "intro": "The AMS1 slot4 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "0700200000020001",
                    "intro": "AMS1 Slot1 filament has run out. Please insert a new filament."
                },
                {
                    "ecode": "0700200000020002",
                    "intro": "AMS 1号槽料线耗尽。"
                },
                {
                    "ecode": "0700200000020003",
                    "intro": "AMS 1号料槽的料线可能断裂在AMS内。"
                },
                {
                    "ecode": "0700210000020001",
                    "intro": "AMS1 Slot2 filament has run out. Please insert a new filament."
                },
                {
                    "ecode": "0700210000020002",
                    "intro": "AMS1 Slot2 is empty; please load a new filament."
                },
                {
                    "ecode": "0700210000020003",
                    "intro": "AMS1 Slot2's filament may be broken in AMS."
                },
                {
                    "ecode": "0700220000020001",
                    "intro": "AMS1 Slot3 filament has run out. Please insert a new filament."
                },
                {
                    "ecode": "0700220000020002",
                    "intro": "AMS1 Slot3 is empty; please load a new filament."
                },
                {
                    "ecode": "0700220000020003",
                    "intro": "AMS1 Slot3's filament may be broken in AMS."
                },
                {
                    "ecode": "0700230000020001",
                    "intro": "AMS 1号槽料线耗尽"
                },
                {
                    "ecode": "0700230000020002",
                    "intro": "AMS1 Slot4 is empty; please load a new filament."
                },
                {
                    "ecode": "0700230000020003",
                    "intro": "AMS1 Slot4's filament may be broken in AMS."
                },
                {
                    "ecode": "0700300000010001",
                    "intro": "The RFID board between AMS1 Slot1 & Slot2 has an error."
                },
                {
                    "ecode": "0700300000010004",
                    "intro": "Encryption chip failure."
                },
                {
                    "ecode": "0700300000020002",
                    "intro": "The RFID-tag on AMS1 Slot1 is damaged or the it's content cannot be identified."
                },
                {
                    "ecode": "0700300000030003",
                    "intro": "RFID cannot be read because of a hardware or structural error."
                },
                {
                    "ecode": "0700310000010001",
                    "intro": "The RFID board between AMS1 Slot3 & Slot4 has an error."
                },
                {
                    "ecode": "0700310000010004",
                    "intro": "Encryption chip failure."
                },
                {
                    "ecode": "0700310000020002",
                    "intro": "The RFID-tag on AMS1 Slot2 is damaged or the it's content cannot be identified."
                },
                {
                    "ecode": "0700310000030003",
                    "intro": "RFID cannot be read because of a hardware or structural error."
                },
                {
                    "ecode": "0700320000020002",
                    "intro": "The RFID-tag on AMS1 Slot3 is damaged or the it's content cannot be identified."
                },
                {
                    "ecode": "0700330000020002",
                    "intro": "The RFID-tag on AMS1 Slot4 is damaged or the it's content cannot be identified."
                },
                {
                    "ecode": "0700350000010001",
                    "intro": "The temperature and humidity sensor has an error. The chip may be faulty."
                },
                {
                    "ecode": "0700400000020001",
                    "intro": "The filament buffer position signal lost: the cable or position sensor may be malfunctioning."
                },
                {
                    "ecode": "0700400000020002",
                    "intro": "The filament buffer position signal error: the position sensor may be malfunctioning."
                },
                {
                    "ecode": "0700400000020003",
                    "intro": "The AMS Hub communication is abnormal, the cable may be not well connected."
                },
                {
                    "ecode": "0700450000020001",
                    "intro": "The filament cutter sensor is malfunctioning; please check whether the connector is properly plugged in."
                },
                {
                    "ecode": "0700450000020002",
                    "intro": "The filament cutter's cutting distance is too large. The XY motor may lose steps."
                },
                {
                    "ecode": "0700450000020003",
                    "intro": "The filament cutter handle has not released. The handle or blade may be stuck."
                },
                {
                    "ecode": "0701010000010001",
                    "intro": "The AMS2 assist motor has slipped. The extrusion wheel may be worn down, or the filament may be too thin."
                },
                {
                    "ecode": "0701010000010003",
                    "intro": "The AMS2 assist motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "0701010000010004",
                    "intro": "The AMS2 assist motor speed control is malfunctioning. The speed sensor may be faulty."
                },
                {
                    "ecode": "0701010000020002",
                    "intro": "The AMS2 assist motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "0701020000010001",
                    "intro": "AMS2 Filament speed and length error: The filament odometry may be faulty."
                },
                {
                    "ecode": "0701100000010001",
                    "intro": "The AMS2 slot1 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "0701100000010003",
                    "intro": "The AMS2 slot1 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "0701100000020002",
                    "intro": "The AMS2 slot1 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "0701110000010001",
                    "intro": "The AMS2 slot2 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "0701110000010003",
                    "intro": "The AMS2 slot2 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "0701110000020002",
                    "intro": "The AMS2 slot2 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "0701120000010001",
                    "intro": "The AMS2 slot3 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "0701120000010003",
                    "intro": "The AMS2 slot3 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "0701120000020002",
                    "intro": "The AMS2 slot3 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "0701130000010001",
                    "intro": "The AMS2 slot4 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "0701130000010003",
                    "intro": "The AMS2 slot4 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "0701130000020002",
                    "intro": "The AMS2 slot4 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "0701200000020001",
                    "intro": "AMS2 Slot1 filament has run out. Please insert a new filament."
                },
                {
                    "ecode": "0701200000020002",
                    "intro": "AMS2 Slot1 is empty; please load a new filament."
                },
                {
                    "ecode": "0701200000020003",
                    "intro": "AMS2 Slot1's filament may be broken in AMS."
                },
                {
                    "ecode": "0701210000020001",
                    "intro": "AMS2 Slot2 filament has run out. Please insert a new filament."
                },
                {
                    "ecode": "0701210000020002",
                    "intro": "AMS2 Slot2 is empty; please load a new filament."
                },
                {
                    "ecode": "0701210000020003",
                    "intro": "AMS2 Slot2's filament may be broken in AMS."
                },
                {
                    "ecode": "0701220000020001",
                    "intro": "AMS2 Slot3 filament has run out. Please insert a new filament."
                },
                {
                    "ecode": "0701220000020002",
                    "intro": "AMS2 Slot3 is empty; please load a new filament."
                },
                {
                    "ecode": "0701220000020003",
                    "intro": "AMS2 Slot3's filament may be broken in AMS."
                },
                {
                    "ecode": "0701230000020001",
                    "intro": "AMS2 Slot4 filament has run out. Please insert a new filament."
                },
                {
                    "ecode": "0701230000020002",
                    "intro": "AMS2 Slot4 is empty; please load a new filament."
                },
                {
                    "ecode": "0701230000020003",
                    "intro": "AMS2 Slot4's filament may be broken in AMS."
                },
                {
                    "ecode": "0701300000010001",
                    "intro": "The RFID board between AMS2 Slot1 & Slot2 has an error."
                },
                {
                    "ecode": "0701300000010004",
                    "intro": "Encryption chip failure."
                },
                {
                    "ecode": "0701300000020002",
                    "intro": "The RFID-tag on AMS2 Slot1 is damaged or the it's content cannot be identified."
                },
                {
                    "ecode": "0701300000030003",
                    "intro": "RFID cannot be read because of a hardware or structural error."
                },
                {
                    "ecode": "0701310000010001",
                    "intro": "The RFID board between AMS2 Slot3 & Slot4 has an error."
                },
                {
                    "ecode": "0701310000010004",
                    "intro": "Encryption chip failure."
                },
                {
                    "ecode": "0701310000020002",
                    "intro": "The RFID-tag on AMS2 Slot2 is damaged or the it's content cannot be identified."
                },
                {
                    "ecode": "0701310000030003",
                    "intro": "RFID cannot be read because of a hardware or structural error."
                },
                {
                    "ecode": "0701320000020002",
                    "intro": "The RFID-tag on AMS2 Slot3 is damaged or the it's content cannot be identified."
                },
                {
                    "ecode": "0701330000020002",
                    "intro": "The RFID-tag on AMS2 Slot4 is damaged or the it's content cannot be identified."
                },
                {
                    "ecode": "0701350000010001",
                    "intro": "The temperature and humidity sensor has an error. The chip may be faulty."
                },
                {
                    "ecode": "0702010000010001",
                    "intro": "The AMS3 assist motor has slipped. The extrusion wheel may be worn down, or the filament may be too thin."
                },
                {
                    "ecode": "0702010000010003",
                    "intro": "The AMS3 assist motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "0702010000010004",
                    "intro": "The AMS3 assist motor speed control is malfunctioning. The speed sensor may be faulty."
                },
                {
                    "ecode": "0702010000020002",
                    "intro": "The AMS3 assist motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "0702020000010001",
                    "intro": "AMS3 Filament speed and length error: The filament odometry may be faulty."
                },
                {
                    "ecode": "0702100000010001",
                    "intro": "The AMS3 slot1 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "0702100000010003",
                    "intro": "The AMS3 slot1 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "0702100000020002",
                    "intro": "The AMS3 slot1 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "0702110000010001",
                    "intro": "The AMS3 slot2 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "0702110000010003",
                    "intro": "The AMS3 slot2 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "0702110000020002",
                    "intro": "The AMS3 slot2 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "0702120000010001",
                    "intro": "The AMS3 slot3 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "0702120000010003",
                    "intro": "The AMS3 slot3 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "0702120000020002",
                    "intro": "The AMS3 slot3 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "0702130000010001",
                    "intro": "The AMS3 slot4 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "0702130000010003",
                    "intro": "The AMS3 slot4 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "0702130000020002",
                    "intro": "The AMS3 slot4 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "0702200000020001",
                    "intro": "AMS3 Slot1 filament has run out. Please insert a new filament."
                },
                {
                    "ecode": "0702200000020002",
                    "intro": "AMS3 Slot1 is empty; please load a new filament."
                },
                {
                    "ecode": "0702200000020003",
                    "intro": "AMS3 Slot1's filament may be broken in AMS."
                },
                {
                    "ecode": "0702210000020001",
                    "intro": "AMS3 Slot2 filament has run out. Please insert a new filament."
                },
                {
                    "ecode": "0702210000020002",
                    "intro": "AMS3 Slot2 is empty; please load a new filament."
                },
                {
                    "ecode": "0702210000020003",
                    "intro": "AMS3 Slot2's filament may be broken in AMS."
                },
                {
                    "ecode": "0702220000020001",
                    "intro": "AMS3 Slot3 filament has run out. Please insert a new filament."
                },
                {
                    "ecode": "0702220000020002",
                    "intro": "AMS3 Slot3 is empty; please load a new filament."
                },
                {
                    "ecode": "0702220000020003",
                    "intro": "AMS3 Slot3's filament may be broken in AMS."
                },
                {
                    "ecode": "0702230000020001",
                    "intro": "AMS3 Slot4 filament has run out. Please insert a new filament."
                },
                {
                    "ecode": "0702230000020002",
                    "intro": "AMS3 Slot4 is empty; please load a new filament."
                },
                {
                    "ecode": "0702230000020003",
                    "intro": "AMS3 Slot4's filament may be broken in AMS."
                },
                {
                    "ecode": "0702300000010001",
                    "intro": "The RFID board between AMS3 Slot1 & Slot2 has an error."
                },
                {
                    "ecode": "0702300000010004",
                    "intro": "Encryption chip failure."
                },
                {
                    "ecode": "0702300000020002",
                    "intro": "The RFID-tag on AMS3 Slot1 is damaged or the it's content cannot be identified."
                },
                {
                    "ecode": "0702300000030003",
                    "intro": "RFID cannot be read because of a hardware or structural error."
                },
                {
                    "ecode": "0702310000010001",
                    "intro": "The RFID board between AMS3 Slot3 & Slot4 has an error."
                },
                {
                    "ecode": "0702310000010004",
                    "intro": "Encryption chip failure."
                },
                {
                    "ecode": "0702310000020002",
                    "intro": "The RFID-tag on AMS3 Slot2 is damaged or the it's content cannot be identified."
                },
                {
                    "ecode": "0702310000030003",
                    "intro": "RFID cannot be read because of a hardware or structural error."
                },
                {
                    "ecode": "0702320000020002",
                    "intro": "The RFID-tag on AMS3 Slot3 is damaged or the it's content cannot be identified."
                },
                {
                    "ecode": "0702330000020002",
                    "intro": "The RFID-tag on AMS3 Slot4 is damaged or the it's content cannot be identified."
                },
                {
                    "ecode": "0702350000010001",
                    "intro": "The temperature and humidity sensor has an error. The chip may be faulty."
                },
                {
                    "ecode": "0703010000010001",
                    "intro": "The AMS4 assist motor has slipped. The extrusion wheel may be worn down, or the filament may be too thin."
                },
                {
                    "ecode": "0703010000010003",
                    "intro": "The AMS4 assist motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "0703010000010004",
                    "intro": "The AMS4 assist motor speed control is malfunctioning. The speed sensor may be faulty."
                },
                {
                    "ecode": "0703010000020002",
                    "intro": "The AMS4 assist motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "0703020000010001",
                    "intro": "AMS4 Filament speed and length error: The filament odometry may be faulty."
                },
                {
                    "ecode": "0703100000010001",
                    "intro": "The AMS4 slot1 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "0703100000010003",
                    "intro": "The AMS4 slot1 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "0703100000020002",
                    "intro": "The AMS4 slot1 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "0703110000010001",
                    "intro": "The AMS4 slot2 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "0703110000010003",
                    "intro": "The AMS4 slot2 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "0703110000020002",
                    "intro": "The AMS4 slot2 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "0703120000010001",
                    "intro": "The AMS4 slot3 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "0703120000010003",
                    "intro": "The AMS4 slot3 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "0703120000020002",
                    "intro": "The AMS4 slot3 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "0703130000010001",
                    "intro": "The AMS4 slot4 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "0703130000010003",
                    "intro": "The AMS4 slot4 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "0703130000020002",
                    "intro": "The AMS4 slot4 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "0703200000020001",
                    "intro": "AMS4 Slot1 filament has run out. Please insert a new filament."
                },
                {
                    "ecode": "0703200000020002",
                    "intro": "AMS4 Slot1 is empty; please load a new filament."
                },
                {
                    "ecode": "0703200000020003",
                    "intro": "AMS4 Slot1's filament may be broken in AMS."
                },
                {
                    "ecode": "0703210000020001",
                    "intro": "AMS4 Slot2 filament has run out. Please insert a new filament."
                },
                {
                    "ecode": "0703210000020002",
                    "intro": "AMS4 Slot2 is empty; please load a new filament."
                },
                {
                    "ecode": "0703210000020003",
                    "intro": "AMS4 Slot2's filament may be broken in AMS."
                },
                {
                    "ecode": "0703220000020001",
                    "intro": "AMS4 Slot3 filament has run out. Please insert a new filament."
                },
                {
                    "ecode": "0703220000020002",
                    "intro": "AMS4 Slot3 is empty; please load a new filament."
                },
                {
                    "ecode": "0703220000020003",
                    "intro": "AMS4 Slot3's filament may be broken in AMS."
                },
                {
                    "ecode": "0703230000020001",
                    "intro": "AMS4 Slot4 filament has run out. Please insert a new filament."
                },
                {
                    "ecode": "0703230000020002",
                    "intro": "AMS4 Slot4 is empty; please load a new filament."
                },
                {
                    "ecode": "0703230000020003",
                    "intro": "AMS4 Slot4's filament may be broken in AMS."
                },
                {
                    "ecode": "0703300000010001",
                    "intro": "The RFID board between AMS4 Slot1 & Slot2 has an error."
                },
                {
                    "ecode": "0703300000010004",
                    "intro": "Encryption chip failure."
                },
                {
                    "ecode": "0703300000020002",
                    "intro": "The RFID-tag on AMS4 Slot1 is damaged or the it's content cannot be identified."
                },
                {
                    "ecode": "0703300000030003",
                    "intro": "RFID cannot be read because of a hardware or structural error."
                },
                {
                    "ecode": "0703310000010001",
                    "intro": "The RFID board between AMS4 Slot3 & Slot4 has an error."
                },
                {
                    "ecode": "0703310000010004",
                    "intro": "Encryption chip failure."
                },
                {
                    "ecode": "0703310000020002",
                    "intro": "The RFID-tag on AMS4 Slot2 is damaged or the it's content cannot be identified."
                },
                {
                    "ecode": "0703310000030003",
                    "intro": "RFID cannot be read because of a hardware or structural error."
                },
                {
                    "ecode": "0703320000020002",
                    "intro": "The RFID-tag on AMS4 Slot3 is damaged or the it's content cannot be identified."
                },
                {
                    "ecode": "0703330000020002",
                    "intro": "The RFID-tag on AMS4 Slot4 is damaged or the it's content cannot be identified."
                },
                {
                    "ecode": "0703350000010001",
                    "intro": "The temperature and humidity sensor has an error. The chip may be faulty."
                },
                {
                    "ecode": "0C00010000010001",
                    "intro": "The Micro Lidar camera is offline. Please check the hardware connection."
                },
                {
                    "ecode": "0C00010000010003",
                    "intro": "Synchronization between the Micro Lidar camera and MCU is abnormal. Please restart your printer."
                },
                {
                    "ecode": "0C00010000010004",
                    "intro": "The Micro Lidar camera lens seems to be dirty. Please clean the lens."
                },
                {
                    "ecode": "0C00010000010005",
                    "intro": "Micro Lidar camera OTP parameter is abnormal. Please contact after-sales."
                },
                {
                    "ecode": "0C00010000010009",
                    "intro": "The chamber camera lens seems to be dirty. Please clean the lens."
                },
                {
                    "ecode": "0C00010000020002",
                    "intro": "The Micro Lidar camera is malfunctioning and related functions may fail. Please contact after-sales if this message keeps appearing in multiple prints."
                },
                {
                    "ecode": "0C00010000020006",
                    "intro": "Micro Lidar camera extrinsic parameters are abnormal. Please enable flowrate calibration in your next print."
                },
                {
                    "ecode": "0C00010000020007",
                    "intro": "Micro Lidar laser parameters are drifted. Please re-calibrate your printer."
                },
                {
                    "ecode": "0C00010000020008",
                    "intro": "Failed to get image from chamber camera. Spaghetti and excess chute pileup detection is not available for now."
                },
                {
                    "ecode": "0C00020000010001",
                    "intro": "The horizontal laser is not lit. Please check if it's covered or hardware connection is normal."
                },
                {
                    "ecode": "0C00020000010005",
                    "intro": "A new Micro Lidar was detected. Please calibrate it on Calibration page before use."
                },
                {
                    "ecode": "0C00020000020002",
                    "intro": "The horizontal laser line is too wide. Please check if the heatbed is dirty."
                },
                {
                    "ecode": "0C00020000020003",
                    "intro": "The horizontal laser is not bright enough at homing position. Please clean or replace heatbed if this message appears repeatedly."
                },
                {
                    "ecode": "0C00020000020004",
                    "intro": "Nozzle height seems too low. Please check if the nozzle is worn or tilted. Re-calibrate Lidar if the nozzle has been replaced."
                },
                {
                    "ecode": "0C00020000020006",
                    "intro": "Nozzle height seems too high. Please check if there is filament residual attached to the nozzle."
                },
                {
                    "ecode": "0C00030000010009",
                    "intro": "The first layer inspection module rebooted abnormally. The inspection result may be inaccurate."
                },
                {
                    "ecode": "0C0003000001000a",
                    "intro": "Your printer is in factory mode. Please contact Technical Support."
                },
                {
                    "ecode": "0C00030000020001",
                    "intro": "Filament exposure metering failed because laser reflection is too weak on this material. First layer inspection may be inaccurate."
                },
                {
                    "ecode": "0C00030000020002",
                    "intro": "First layer inspection terminated due to abnormal Lidar data."
                },
                {
                    "ecode": "0C00030000020004",
                    "intro": "First layer inspection is not supported for the current print job."
                },
                {
                    "ecode": "0C00030000020005",
                    "intro": "First layer inspection timed out abnormally, and the current results may be inaccurate."
                },
                {
                    "ecode": "0C00030000030006",
                    "intro": "Purged filament may have piled up in the excess chute. Please check and clean the excess chute."
                },
                {
                    "ecode": "0C00030000030007",
                    "intro": "Possible first layer defects have been detected. Please check the first layer quality and decide if the job should be stopped."
                },
                {
                    "ecode": "0C00030000030008",
                    "intro": "Possible spaghetti defects were detected. Please check the print quality and decide if the job should be stopped."
                },
                {
                    "ecode": "0C0003000003000b",
                    "intro": "Inspecting the first layer: please wait a moment."
                },
                {
                    "ecode": "0300010000010006",
                    "intro": "The heatbed temperature is abnormal; the sensor may have a short circuit."
                },
                {
                    "ecode": "0300010000010007",
                    "intro": "The heatbed temperature is abnormal; the sensor may have an open circuit."
                },
                {
                    "ecode": "0300020000010006",
                    "intro": "The nozzle temperature is abnormal; the sensor may have a short circuit, please check whether the connector is properly plugged."
                },
                {
                    "ecode": "0300020000010007",
                    "intro": "The nozzle temperature is abnormal; the sensor may have an open circuit."
                },
                {
                    "ecode": "03000D000001000B",
                    "intro": "The Z axis motor seems to be stuck when moving. Please check if there is any foreign matter on the Z sliders or Z timing belt wheels ."
                },
                {
                    "ecode": "0300100000020002",
                    "intro": "The resonance frequency of the X axis differs greatly from last calibration. Please clean the carbon rod and rerun the machine calibration afterward."
                },
                {
                    "ecode": "0300110000020002",
                    "intro": "The resonance frequency of the Y axis differs greatly from the last calibration. Please clean the carbon rod and rerun the machine calibration afterward."
                },
                {
                    "ecode": "0C0003000002000c",
                    "intro": "The build plate localization marker is not detected. Please check if the build plate is aligned correctly."
                },
                {
                    "ecode": "0C0001000001000A",
                    "intro": "The Micro Lidar LED may be broken."
                },
                {
                    "ecode": "0C00020000020007",
                    "intro": "The vertical laser is not lit. Please check if it's covered or hardware connection is normal."
                },
                {
                    "ecode": "0C00020000020008",
                    "intro": "The vertical laser line is too wide. Please check if the heatbed is dirty."
                },
                {
                    "ecode": "0C0003000003000d",
                    "intro": "Some objects may have fallen down, or the extruder is not extruding normally. Please check and decide if the printing should be stopped."
                },
                {
                    "ecode": "0C0003000003000e",
                    "intro": "Your printer seems to be printing without extruding."
                },
                {
                    "ecode": "0C0003000003000f",
                    "intro": "Your nozzle seems to be covered with jammed or clogged material."
                },
                {
                    "ecode": "0300060000010003",
                    "intro": "The resistance of Motor-A is abnormal, the motor may have failed."
                },
                {
                    "ecode": "0300070000010003",
                    "intro": "The resistance of Motor-B is abnormal, the motor may have failed."
                },
                {
                    "ecode": "0300080000010003",
                    "intro": "The resistance of Motor-Z is abnormal, the motor may have failed."
                },
                {
                    "ecode": "0300090000010003",
                    "intro": "The resistance of Motor-E is abnormal, the motor may have failed."
                },
                {
                    "ecode": "0300130000010001",
                    "intro": "The current sensor of Motor-A is abnormal. This may be caused by a failure of the hardware sampling circuit."
                },
                {
                    "ecode": "0300140000010001",
                    "intro": "The current sensor of Motor-B is abnormal. This may be caused by a failure of the hardware sampling circuit."
                },
                {
                    "ecode": "0300150000010001",
                    "intro": "The current sensor of Motor-Z is abnormal. This may be caused by a failure of the hardware sampling circuit."
                },
                {
                    "ecode": "0300160000010001",
                    "intro": "The current sensor of Motor-E is abnormal. This may be caused by a failure of the hardware sampling circuit."
                },
                {
                    "ecode": "0701200000030001",
                    "intro": "AMS2 Slot1 filament has run out. Please wait while old filament is purged."
                },
                {
                    "ecode": "0702200000030001",
                    "intro": "AMS3 Slot1 filament has run out. Please wait while old filament is purged."
                },
                {
                    "ecode": "0703200000030001",
                    "intro": "AMS4 Slot1 filament has run out. Please wait while old filament is purged."
                },
                {
                    "ecode": "0701210000030001",
                    "intro": "AMS2 Slot2 filament has run out. Please wait while old filament is purged."
                },
                {
                    "ecode": "0702210000030001",
                    "intro": "AMS3 Slot2 filament has run out. Please wait while old filament is purged."
                },
                {
                    "ecode": "0703210000030001",
                    "intro": "AMS4 Slot2 filament has run out. Please wait while old filament is purged."
                },
                {
                    "ecode": "0701220000030001",
                    "intro": "AMS2 Slot3 filament has run out. Please wait while old filament is purged."
                },
                {
                    "ecode": "0702220000030001",
                    "intro": "AMS3 Slot3 filament has run out. Please wait while old filament is purged."
                },
                {
                    "ecode": "0703220000030001",
                    "intro": "AMS4 Slot3 filament has run out. Please wait while old filament is purged."
                },
                {
                    "ecode": "0700230000030001",
                    "intro": "AMS1 Slot4 filament has run out. Please wait while old filament is purged."
                },
                {
                    "ecode": "0701230000030001",
                    "intro": "AMS2 Slot4 filament has run out. Please wait while old filament is purged."
                },
                {
                    "ecode": "0702230000030001",
                    "intro": "AMS3 Slot4 filament has run out. Please wait while old filament is purged."
                },
                {
                    "ecode": "0703230000030001",
                    "intro": "AMS4 Slot4 filament has run out. Please wait while old filament is purged."
                },
                {
                    "ecode": "0700500000020001",
                    "intro": "AMS1 communication is abnormal; please check the connection cable."
                },
                {
                    "ecode": "0701500000020001",
                    "intro": "AMS2 communication is abnormal; please check the connection cable."
                },
                {
                    "ecode": "0702500000020001",
                    "intro": "AMS3 communication is abnormal; please check the connection cable."
                },
                {
                    "ecode": "0703500000020001",
                    "intro": "AMS4 communication is abnormal; please check the connection cable."
                },
                {
                    "ecode": "0700510000030001",
                    "intro": "The AMS is disabled; please load filament from spool holder."
                },
                {
                    "ecode": "0500040000020007",
                    "intro": "The bed temperature exceeds the filament's vitrification temperature, which may cause a nozzle clog. Please keep the front door of the printer open or lower the bed temperature."
                },
                {
                    "ecode": "0C00020000020009",
                    "intro": "The vertical laser is not bright enough at homing position. Please clean or replace heatbed if this message appears repeatedly."
                },
                {
                    "ecode": "0C0001000001000B",
                    "intro": "Failed to calibrate Micro Lidar. Please make sure the calibration chart is clean and not occluded, and run machine calibration again."
                },
                {
                    "ecode": "0500030000020010",
                    "intro": "forward coredump, it is recovering."
                },
                {
                    "ecode": "0500030000020011",
                    "intro": "upgrade coredump, it is recovering."
                },
                {
                    "ecode": "0500030000020012",
                    "intro": "ipcam coredump, it is recovering."
                },
                {
                    "ecode": "0500030000020013",
                    "intro": "xcam coredump, it is recovering."
                },
                {
                    "ecode": "0500030000020014",
                    "intro": "bbl_screen coredump, it is recovering."
                },
                {
                    "ecode": "0500030000020015",
                    "intro": "device_gate coredump, it is recovering."
                },
                {
                    "ecode": "0500030000020016",
                    "intro": "device_manager coredump, it is recovering."
                },
                {
                    "ecode": "0500030000020017",
                    "intro": "recorder coredump, it is recovering."
                },
                {
                    "ecode": "0500030000020018",
                    "intro": "security coredump, it is recovering."
                },
                {
                    "ecode": "0300200000010001",
                    "intro": "X axis homing abnormal: please check if the tool head is stuck or the carbon rod has too much resistance."
                },
                {
                    "ecode": "0300200000010002",
                    "intro": "Y axis homing abnormal: please check if the tool head is stuck or the Y carriage has too much resistance."
                },
                {
                    "ecode": "0300200000010003",
                    "intro": "X axis homing abnormal: the timing belt may be loose."
                },
                {
                    "ecode": "0300200000010004",
                    "intro": "Y axis homing abnormal: the timing belt may be loose."
                },
                {
                    "ecode": "0300400000020001",
                    "intro": "Data transmission over the serial port is abnormal; the software system may be faulty."
                },
                {
                    "ecode": "0300410000010001",
                    "intro": "The system voltage is unstable; triggering the power failure protection function."
                },
                {
                    "ecode": "0700400000020004",
                    "intro": "The filament buffer signal is abnormal; the spring may be stuck or the filament may be tangle."
                },
                {
                    "ecode": "0700600000020001",
                    "intro": "The AMS1 slot1 is overloaded. The filament may be tangled or the spool may be stuck."
                },
                {
                    "ecode": "0701600000020001",
                    "intro": "The AMS2 slot1 is overloaded. The filament may be tangled or the spool may be stuck."
                },
                {
                    "ecode": "0702600000020001",
                    "intro": "The AMS3 slot1 is overloaded. The filament may be tangled or the spool may be stuck."
                },
                {
                    "ecode": "0703600000020001",
                    "intro": "The AMS4 slot1 is overloaded. The filament may be tangled or the spool may be stuck."
                },
                {
                    "ecode": "0700610000020001",
                    "intro": "The AMS1 slot2 is overloaded. The filament may be tangled or the spool may be stuck."
                },
                {
                    "ecode": "0701610000020001",
                    "intro": "The AMS2 slot2 is overloaded. The filament may be tangled or the spool may be stuck."
                },
                {
                    "ecode": "0702610000020001",
                    "intro": "The AMS3 slot2 is overloaded. The filament may be tangled or the spool may be stuck."
                },
                {
                    "ecode": "0703610000020001",
                    "intro": "The AMS4 slot2 is overloaded. The filament may be tangled or the spool may be stuck."
                },
                {
                    "ecode": "0700620000020001",
                    "intro": "The AMS1 slot3 is overloaded. The filament may be tangled or the spool may be stuck."
                },
                {
                    "ecode": "0701620000020001",
                    "intro": "The AMS2 slot3 is overloaded. The filament may be tangled or the spool may be stuck."
                },
                {
                    "ecode": "0702620000020001",
                    "intro": "The AMS3 slot3 is overloaded. The filament may be tangled or the spool may be stuck."
                },
                {
                    "ecode": "0703620000020001",
                    "intro": "The AMS4 slot3 is overloaded. The filament may be tangled or the spool may be stuck."
                },
                {
                    "ecode": "0700630000020001",
                    "intro": "The AMS1 slot4 is overloaded. The filament may be tangled or the spool may be stuck."
                },
                {
                    "ecode": "0701630000020001",
                    "intro": "The AMS2 slot4 is overloaded. The filament may be tangled or the spool may be stuck."
                },
                {
                    "ecode": "0702630000020001",
                    "intro": "The AMS3 slot4 is overloaded. The filament may be tangled or the spool may be stuck."
                },
                {
                    "ecode": "0703630000020001",
                    "intro": "The AMS4 slot4 is overloaded. The filament may be tangled or the spool may be stuck."
                },
                {
                    "ecode": "0300010000030008",
                    "intro": "The temperature of the heated bed exceeds the limit and automatically adjusts to the limit temperature."
                },
                {
                    "ecode": "0700200000020004",
                    "intro": "AMS1 Slot1 filament may be broken in the tool head."
                },
                {
                    "ecode": "0701200000020004",
                    "intro": "AMS2 Slot1 filament may be broken in the tool head."
                },
                {
                    "ecode": "0702200000020004",
                    "intro": "AMS3 Slot1 filament may be broken in the tool head."
                },
                {
                    "ecode": "0703200000020004",
                    "intro": "AMS4 Slot1 filament may be broken in the tool head."
                },
                {
                    "ecode": "0700210000020004",
                    "intro": "AMS1 Slot2 filament may be broken in the tool head."
                },
                {
                    "ecode": "0701210000020004",
                    "intro": "AMS2 Slot2 filament may be broken in the tool head."
                },
                {
                    "ecode": "0702210000020004",
                    "intro": "AMS3 Slot2 filament may be broken in the tool head."
                },
                {
                    "ecode": "0703210000020004",
                    "intro": "AMS4 Slot2 filament may be broken in the tool head."
                },
                {
                    "ecode": "0700220000020004",
                    "intro": "AMS1 Slot3 filament may be broken in the tool head."
                },
                {
                    "ecode": "0701220000020004",
                    "intro": "AMS2 Slot3 filament may be broken in the tool head."
                },
                {
                    "ecode": "0702220000020004",
                    "intro": "AMS3 Slot3 filament may be broken in the tool head."
                },
                {
                    "ecode": "0703220000020004",
                    "intro": "AMS4 Slot3 filament may be broken in the tool head."
                },
                {
                    "ecode": "0700230000020004",
                    "intro": "AMS1 Slot4 filament may be broken in the tool head."
                },
                {
                    "ecode": "0701230000020004",
                    "intro": "AMS2 Slot4 filament may be broken in the tool head."
                },
                {
                    "ecode": "0702230000020004",
                    "intro": "AMS3 Slot4 filament may be broken in the tool head."
                },
                {
                    "ecode": "0703230000020004",
                    "intro": "AMS4 Slot4 filament may be broken in the tool head."
                },
                {
                    "ecode": "0700200000020005",
                    "intro": "AMS1 Slot1 filament has run out, and purging the old filament went abnormally; please check whether the filament is stuck in the tool head."
                },
                {
                    "ecode": "0701200000020005",
                    "intro": "AMS2 Slot1 filament has run out, and purging the old filament went abnormally; please check whether the filament is stuck in the tool head."
                },
                {
                    "ecode": "0702200000020005",
                    "intro": "AMS3 Slot1 filament has run out, and purging the old filament went abnormally; please check whether the filament is stuck in the tool head."
                },
                {
                    "ecode": "0703200000020005",
                    "intro": "AMS4 Slot1 filament has run out, and purging the old filament went abnormally; please check whether the filament is stuck in the tool head."
                },
                {
                    "ecode": "0700210000020005",
                    "intro": "AMS1 Slot2 filament has run out, and purging the old filament went abnormally; please check whether the filament is stuck in the tool head."
                },
                {
                    "ecode": "0701210000020005",
                    "intro": "AMS2 Slot2 filament has run out, and purging the old filament went abnormally; please check whether the filament is stuck in the tool head."
                },
                {
                    "ecode": "0702210000020005",
                    "intro": "AMS3 Slot2 filament has run out, and purging the old filament went abnormally; please check whether the filament is stuck in the tool head."
                },
                {
                    "ecode": "0703210000020005",
                    "intro": "AMS4 Slot2 filament has run out, and purging the old filament went abnormally; please check whether the filament is stuck in the tool head."
                },
                {
                    "ecode": "0700220000020005",
                    "intro": "AMS1 Slot3 filament has run out, and purging the old filament went abnormally; please check whether the filament is stuck in the tool head."
                },
                {
                    "ecode": "0701220000020005",
                    "intro": "AMS2 Slot3 filament has run out, and purging the old filament went abnormally; please check whether the filament is stuck in the tool head."
                },
                {
                    "ecode": "0702220000020005",
                    "intro": "AMS3 Slot3 filament has run out, and purging the old filament went abnormally; please check whether the filament is stuck in the tool head."
                },
                {
                    "ecode": "0703220000020005",
                    "intro": "AMS4 Slot3 filament has run out, and purging the old filament went abnormally; please check whether the filament is stuck in the tool head."
                },
                {
                    "ecode": "0700230000020005",
                    "intro": "AMS1 Slot4 filament has run out, and purging the old filament went abnormally; please check whether the filament is stuck in the tool head."
                },
                {
                    "ecode": "0701230000020005",
                    "intro": "AMS2 Slot4 filament has run out, and purging the old filament went abnormally; please check whether the filament is stuck in the tool head."
                },
                {
                    "ecode": "0702230000020005",
                    "intro": "AMS3 Slot4 filament has run out, and purging the old filament went abnormally; please check whether the filament is stuck in the tool head."
                },
                {
                    "ecode": "0703230000020005",
                    "intro": "AMS4 Slot4 filament has run out, and purging the old filament went abnormally; please check whether the filament is stuck in the tool head."
                },
                {
                    "ecode": "0701200000030002",
                    "intro": "AMS2 Slot1 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "0702200000030002",
                    "intro": "AMS3 Slot1 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "0703200000030002",
                    "intro": "AMS4 Slot1 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "0701210000030002",
                    "intro": "AMS2 Slot2 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "0702210000030002",
                    "intro": "AMS3 Slot2 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "0703210000030002",
                    "intro": "AMS4 Slot2 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "0701220000030002",
                    "intro": "AMS2 Slot3 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "0702220000030002",
                    "intro": "AMS3 Slot3 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "0703220000030002",
                    "intro": "AMS4 Slot3 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "0700230000030002",
                    "intro": "AMS1 Slot4 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "0701230000030002",
                    "intro": "AMS2 Slot4 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "0702230000030002",
                    "intro": "AMS3 Slot4 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "0703230000030002",
                    "intro": "AMS4 Slot4 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "0700200000030001",
                    "intro": "AMS1 Slot1 filament has run out. Please wait while old filament is purged."
                },
                {
                    "ecode": "0700210000030001",
                    "intro": "AMS1 Slot2 filament has run out. Please wait while old filament is purged."
                },
                {
                    "ecode": "0700220000030001",
                    "intro": "AMS1 Slot3 filament has run out. Please wait while old filament is purged."
                },
                {
                    "ecode": "0700200000030002",
                    "intro": "AMS1 Slot1 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "0700210000030002",
                    "intro": "AMS1 Slot2 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "0700220000030002",
                    "intro": "AMS1 Slot3 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "0500030000020020",
                    "intro": "Micro SD Card capacity is insufficient to cache print files."
                },
                {
                    "ecode": "0500030000010021",
                    "intro": "Hardware incompatible, please check the laser."
                },
                {
                    "ecode": "0500030000030022",
                    "intro": "MicroSD Card performance degradation has been detected. It may affect print jobs, logs, and video records. Please try to format or change the MicroSD card."
                },
                {
                    "ecode": "07FF200000020001",
                    "intro": "External filament has run out; please load a new filament."
                },
                {
                    "ecode": "07FF200000020002",
                    "intro": "External filament is missing; please load a new filament."
                },
                {
                    "ecode": "07FF200000020004",
                    "intro": "Please pull the external filament from the extruder."
                },
                {
                    "ecode": "0500040000030008",
                    "intro": "The door is detected to be open."
                },
                {
                    "ecode": "0500010000030007",
                    "intro": "Unable to record time-lapse photography without MicroSD card inserted."
                },
                {
                    "ecode": "1200100000010001",
                    "intro": "The AMS1 Slot1 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "1201100000010001",
                    "intro": "The AMS2 Slot1 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "1202100000010001",
                    "intro": "The AMS3 Slot1 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "1203100000010001",
                    "intro": "The AMS4 Slot1 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "1200110000010001",
                    "intro": "The AMS1 Slot2 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "1201110000010001",
                    "intro": "The AMS2 Slot2 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "1202110000010001",
                    "intro": "The AMS3 Slot2 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "1203110000010001",
                    "intro": "The AMS4 Slot2 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "1200120000010001",
                    "intro": "The AMS1 Slot3 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "1201120000010001",
                    "intro": "The AMS2 Slot3 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "1202120000010001",
                    "intro": "The AMS3 Slot3 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "1203120000010001",
                    "intro": "The AMS4 Slot3 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "1200130000010001",
                    "intro": "The AMS1 Slot4 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "1201130000010001",
                    "intro": "The AMS2 Slot4 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "1202130000010001",
                    "intro": "The AMS3 Slot4 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "1203130000010001",
                    "intro": "The AMS4 Slot4 motor has slipped. The extrusion wheel may be malfunctioning, or the filament may be too thin."
                },
                {
                    "ecode": "1200100000020002",
                    "intro": "The AMS1 Slot1 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "1201100000020002",
                    "intro": "The AMS2 Slot1 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "1202100000020002",
                    "intro": "The AMS3 Slot1 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "1203100000020002",
                    "intro": "The AMS4 Slot1 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "1200110000020002",
                    "intro": "The AMS1 Slot2 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "1201110000020002",
                    "intro": "The AMS2 Slot2 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "1202110000020002",
                    "intro": "The AMS3 Slot2 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "1203110000020002",
                    "intro": "The AMS4 Slot2 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "1200120000020002",
                    "intro": "The AMS1 Slot3 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "1201120000020002",
                    "intro": "The AMS2 Slot3 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "1202120000020002",
                    "intro": "The AMS3 Slot3 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "1203120000020002",
                    "intro": "The AMS4 Slot3 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "1200130000020002",
                    "intro": "The AMS1 Slot4 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "1201130000020002",
                    "intro": "The AMS2 Slot4 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "1202130000020002",
                    "intro": "The AMS3 Slot4 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "1203130000020002",
                    "intro": "The AMS4 Slot4 motor is overloaded. The filament may be tangled or stuck."
                },
                {
                    "ecode": "1200100000010003",
                    "intro": "The AMS1 Slot1 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "1201100000010003",
                    "intro": "The AMS2 Slot1 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "1202100000010003",
                    "intro": "The AMS3 Slot1 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "1203100000010003",
                    "intro": "The AMS4 Slot1 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "1200110000010003",
                    "intro": "The AMS1 Slot2 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "1201110000010003",
                    "intro": "The AMS2 Slot2 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "1202110000010003",
                    "intro": "The AMS3 Slot2 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "1203110000010003",
                    "intro": "The AMS4 Slot2 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "1200120000010003",
                    "intro": "The AMS1 Slot3 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "1201120000010003",
                    "intro": "The AMS2 Slot3 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "1202120000010003",
                    "intro": "The AMS3 Slot3 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "1203120000010003",
                    "intro": "The AMS4 Slot3 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "1200130000010003",
                    "intro": "The AMS1 Slot4 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "1201130000010003",
                    "intro": "The AMS2 Slot4 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "1202130000010003",
                    "intro": "The AMS3 Slot4 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "1203130000010003",
                    "intro": "The AMS4 Slot4 motor torque control is malfunctioning. The current sensor may be faulty."
                },
                {
                    "ecode": "1200200000020001",
                    "intro": "AMS1 Slot1 filament has run out; please insert a new filament."
                },
                {
                    "ecode": "1201200000020001",
                    "intro": "AMS2 Slot1 filament has run out; please insert a new filament."
                },
                {
                    "ecode": "1202200000020001",
                    "intro": "AMS3 Slot1 filament has run out; please insert a new filament."
                },
                {
                    "ecode": "1203200000020001",
                    "intro": "AMS4 Slot1 filament has run out; please insert a new filament."
                },
                {
                    "ecode": "1200210000020001",
                    "intro": "AMS1 Slot2 filament has run out; please insert a new filament."
                },
                {
                    "ecode": "1201210000020001",
                    "intro": "AMS2 Slot2 filament has run out; please insert a new filament."
                },
                {
                    "ecode": "1202210000020001",
                    "intro": "AMS3 Slot2 filament has run out; please insert a new filament."
                },
                {
                    "ecode": "1203210000020001",
                    "intro": "AMS4 Slot2 filament has run out; please insert a new filament."
                },
                {
                    "ecode": "1200220000020001",
                    "intro": "AMS1 Slot3 filament has run out; please insert a new filament."
                },
                {
                    "ecode": "1201220000020001",
                    "intro": "AMS2 Slot3 filament has run out; please insert a new filament."
                },
                {
                    "ecode": "1202220000020001",
                    "intro": "AMS3 Slot3 filament has run out; please insert a new filament."
                },
                {
                    "ecode": "1203220000020001",
                    "intro": "AMS4 Slot3 filament has run out; please insert a new filament."
                },
                {
                    "ecode": "1200230000020001",
                    "intro": "AMS1 Slot4 filament has run out; please insert a new filament."
                },
                {
                    "ecode": "1201230000020001",
                    "intro": "AMS2 Slot4 filament has run out; please insert a new filament."
                },
                {
                    "ecode": "1202230000020001",
                    "intro": "AMS3 Slot4 filament has run out; please insert a new filament."
                },
                {
                    "ecode": "1203230000020001",
                    "intro": "AMS4 Slot4 filament has run out; please insert a new filament."
                },
                {
                    "ecode": "12FF200000020001",
                    "intro": "Filament at the spool holder has run out; please insert a new filament."
                },
                {
                    "ecode": "1200200000020002",
                    "intro": "AMS1 Slot1 is empty; please insert a new filament."
                },
                {
                    "ecode": "1201200000020002",
                    "intro": "AMS2 Slot1 is empty; please insert a new filament."
                },
                {
                    "ecode": "1202200000020002",
                    "intro": "AMS3 Slot1 is empty; please insert a new filament."
                },
                {
                    "ecode": "1203200000020002",
                    "intro": "AMS4 Slot1 is empty; please insert a new filament."
                },
                {
                    "ecode": "1200210000020002",
                    "intro": "AMS1 Slot2 is empty; please insert a new filament."
                },
                {
                    "ecode": "1201210000020002",
                    "intro": "AMS2 Slot2 is empty; please insert a new filament."
                },
                {
                    "ecode": "1202210000020002",
                    "intro": "AMS3 Slot2 is empty; please insert a new filament."
                },
                {
                    "ecode": "1203210000020002",
                    "intro": "AMS4 Slot2 is empty; please insert a new filament."
                },
                {
                    "ecode": "1200220000020002",
                    "intro": "AMS1 Slot3 is empty; please insert a new filament."
                },
                {
                    "ecode": "1201220000020002",
                    "intro": "AMS2 Slot3 is empty; please insert a new filament."
                },
                {
                    "ecode": "1202220000020002",
                    "intro": "AMS3 Slot3 is empty; please insert a new filament."
                },
                {
                    "ecode": "1203220000020002",
                    "intro": "AMS4 Slot3 is empty; please insert a new filament."
                },
                {
                    "ecode": "1200230000020002",
                    "intro": "AMS1 Slot4 is empty; please insert a new filament."
                },
                {
                    "ecode": "1201230000020002",
                    "intro": "AMS2 Slot4 is empty; please insert a new filament."
                },
                {
                    "ecode": "1202230000020002",
                    "intro": "AMS3 Slot4 is empty; please insert a new filament."
                },
                {
                    "ecode": "1203230000020002",
                    "intro": "AMS4 Slot4 is empty; please insert a new filament."
                },
                {
                    "ecode": "12FF200000020002",
                    "intro": "Filament on the spool holder is empty; please insert a new filament."
                },
                {
                    "ecode": "1200200000020003",
                    "intro": "AMS1 Slot1 filament may be broken in the PTFE tube."
                },
                {
                    "ecode": "1201200000020003",
                    "intro": "AMS2 Slot1 filament may be broken in the PTFE tube."
                },
                {
                    "ecode": "1202200000020003",
                    "intro": "AMS3 Slot1 filament may be broken in the PTFE tube."
                },
                {
                    "ecode": "1203200000020003",
                    "intro": "AMS4 Slot1 filament may be broken in the PTFE tube."
                },
                {
                    "ecode": "1200210000020003",
                    "intro": "AMS1 Slot2 filament may be broken in the PTFE tube."
                },
                {
                    "ecode": "1201210000020003",
                    "intro": "AMS2 Slot2 filament may be broken in the PTFE tube."
                },
                {
                    "ecode": "1202210000020003",
                    "intro": "AMS3 Slot2 filament may be broken in the PTFE tube."
                },
                {
                    "ecode": "1203210000020003",
                    "intro": "AMS4 Slot2 filament may be broken in the PTFE tube."
                },
                {
                    "ecode": "1200220000020003",
                    "intro": "AMS1 Slot3 filament may be broken in the PTFE tube."
                },
                {
                    "ecode": "1201220000020003",
                    "intro": "AMS2 Slot3 filament may be broken in the PTFE tube."
                },
                {
                    "ecode": "1202220000020003",
                    "intro": "AMS3 Slot3 filament may be broken in the PTFE tube."
                },
                {
                    "ecode": "1203220000020003",
                    "intro": "AMS4 Slot3 filament may be broken in the PTFE tube."
                },
                {
                    "ecode": "1200230000020003",
                    "intro": "AMS1 Slot4 filament may be broken in the PTFE tube."
                },
                {
                    "ecode": "1201230000020003",
                    "intro": "AMS2 Slot4 filament may be broken in the PTFE tube."
                },
                {
                    "ecode": "1202230000020003",
                    "intro": "AMS3 Slot4 filament may be broken in the PTFE tube."
                },
                {
                    "ecode": "1203230000020003",
                    "intro": "AMS4 Slot4 filament may be broken in the PTFE tube."
                },
                {
                    "ecode": "1200200000020004",
                    "intro": "AMS1 Slot1 filament may be broken in the tool head."
                },
                {
                    "ecode": "1201200000020004",
                    "intro": "AMS2 Slot1 filament may be broken in the tool head."
                },
                {
                    "ecode": "1202200000020004",
                    "intro": "AMS3 Slot1 filament may be broken in the tool head."
                },
                {
                    "ecode": "1203200000020004",
                    "intro": "AMS4 Slot1 filament may be broken in the tool head."
                },
                {
                    "ecode": "1200210000020004",
                    "intro": "AMS1 Slot2 filament may be broken in the tool head."
                },
                {
                    "ecode": "1201210000020004",
                    "intro": "AMS2 Slot2 filament may be broken in the tool head."
                },
                {
                    "ecode": "1202210000020004",
                    "intro": "AMS3 Slot2 filament may be broken in the tool head."
                },
                {
                    "ecode": "1203210000020004",
                    "intro": "AMS4 Slot2 filament may be broken in the tool head."
                },
                {
                    "ecode": "1200220000020004",
                    "intro": "AMS1 Slot3 filament may be broken in the tool head."
                },
                {
                    "ecode": "1201220000020004",
                    "intro": "AMS2 Slot3 filament may be broken in the tool head."
                },
                {
                    "ecode": "1202220000020004",
                    "intro": "AMS3 Slot3 filament may be broken in the tool head."
                },
                {
                    "ecode": "1203220000020004",
                    "intro": "AMS4 Slot3 filament may be broken in the tool head."
                },
                {
                    "ecode": "1200230000020004",
                    "intro": "AMS1 Slot4 filament may be broken in the tool head."
                },
                {
                    "ecode": "1201230000020004",
                    "intro": "AMS2 Slot4 filament may be broken in the tool head."
                },
                {
                    "ecode": "1202230000020004",
                    "intro": "AMS3 Slot4 filament may be broken in the tool head."
                },
                {
                    "ecode": "1203230000020004",
                    "intro": "AMS4 Slot4 filament may be broken in the tool head."
                },
                {
                    "ecode": "12FF200000020004",
                    "intro": "Please pull out the filament on the spool holder from the extruder."
                },
                {
                    "ecode": "1200200000020005",
                    "intro": "AMS1 Slot1 filament has run out, and purging the old filament went abnormally; please check to see if filament is stuck in the toolhead."
                },
                {
                    "ecode": "1201200000020005",
                    "intro": "AMS2 Slot1 filament has run out, and purging the old filament went abnormally; please check to see if filament is stuck in the toolhead."
                },
                {
                    "ecode": "1202200000020005",
                    "intro": "AMS3 Slot1 filament has run out, and purging the old filament went abnormally; please check to see if filament is stuck in the toolhead."
                },
                {
                    "ecode": "1203200000020005",
                    "intro": "AMS4 Slot1 filament has run out, and purging the old filament went abnormally; please check to see if filament is stuck in the toolhead."
                },
                {
                    "ecode": "1200210000020005",
                    "intro": "AMS1 Slot2 filament has run out, and purging the old filament went abnormally; please check to see if filament is stuck in the toolhead."
                },
                {
                    "ecode": "1201210000020005",
                    "intro": "AMS2 Slot2 filament has run out, and purging the old filament went abnormally; please check to see if filament is stuck in the toolhead."
                },
                {
                    "ecode": "1202210000020005",
                    "intro": "AMS3 Slot2 filament has run out, and purging the old filament went abnormally; please check to see if filament is stuck in the toolhead."
                },
                {
                    "ecode": "1203210000020005",
                    "intro": "AMS4 Slot2 filament has run out, and purging the old filament went abnormally; please check to see if filament is stuck in the toolhead."
                },
                {
                    "ecode": "1200220000020005",
                    "intro": "AMS1 Slot3 filament has run out, and purging the old filament went abnormally; please check to see if filament is stuck in the toolhead."
                },
                {
                    "ecode": "1201220000020005",
                    "intro": "AMS2 Slot3 filament has run out, and purging the old filament went abnormally; please check to see if filament is stuck in the toolhead."
                },
                {
                    "ecode": "1202220000020005",
                    "intro": "AMS3 Slot3 filament has run out, and purging the old filament went abnormally; please check to see if filament is stuck in the toolhead."
                },
                {
                    "ecode": "1203220000020005",
                    "intro": "AMS4 Slot3 filament has run out, and purging the old filament went abnormally; please check to see if filament is stuck in the toolhead."
                },
                {
                    "ecode": "1200230000020005",
                    "intro": "AMS1 Slot4 filament has run out, and purging the old filament went abnormally; please check to see if filament is stuck in the toolhead."
                },
                {
                    "ecode": "1201230000020005",
                    "intro": "AMS2 Slot4 filament has run out, and purging the old filament went abnormally; please check to see if filament is stuck in the toolhead."
                },
                {
                    "ecode": "1202230000020005",
                    "intro": "AMS3 Slot4 filament has run out, and purging the old filament went abnormally; please check to see if filament is stuck in the toolhead."
                },
                {
                    "ecode": "1203230000020005",
                    "intro": "AMS4 Slot4 filament has run out, and purging the old filament went abnormally; please check to see if filament is stuck in the toolhead."
                },
                {
                    "ecode": "1200200000030001",
                    "intro": "AMS1 Slot1 filament has run out. Purging the old filament; please wait."
                },
                {
                    "ecode": "1201200000030001",
                    "intro": "AMS2 Slot1 filament has run out. Purging the old filament; please wait."
                },
                {
                    "ecode": "1202200000030001",
                    "intro": "AMS3 Slot1 filament has run out. Purging the old filament; please wait."
                },
                {
                    "ecode": "1203200000030001",
                    "intro": "AMS4 Slot1 filament has run out. Purging the old filament; please wait."
                },
                {
                    "ecode": "1200210000030001",
                    "intro": "AMS1 Slot2 filament has run out. Purging the old filament; please wait."
                },
                {
                    "ecode": "1201210000030001",
                    "intro": "AMS2 Slot2 filament has run out. Purging the old filament; please wait."
                },
                {
                    "ecode": "1202210000030001",
                    "intro": "AMS3 Slot2 filament has run out. Purging the old filament; please wait."
                },
                {
                    "ecode": "1203210000030001",
                    "intro": "AMS4 Slot2 filament has run out. Purging the old filament; please wait."
                },
                {
                    "ecode": "1200220000030001",
                    "intro": "AMS1 Slot3 filament has run out. Purging the old filament; please wait."
                },
                {
                    "ecode": "1201220000030001",
                    "intro": "AMS2 Slot3 filament has run out. Purging the old filament; please wait."
                },
                {
                    "ecode": "1202220000030001",
                    "intro": "AMS3 Slot3 filament has run out. Purging the old filament; please wait."
                },
                {
                    "ecode": "1203220000030001",
                    "intro": "AMS4 Slot3 filament has run out. Purging the old filament; please wait."
                },
                {
                    "ecode": "1200230000030001",
                    "intro": "AMS1 Slot4 filament has run out. Purging the old filament; please wait."
                },
                {
                    "ecode": "1201230000030001",
                    "intro": "AMS2 Slot4 filament has run out. Purging the old filament; please wait."
                },
                {
                    "ecode": "1202230000030001",
                    "intro": "AMS3 Slot4 filament has run out. Purging the old filament; please wait."
                },
                {
                    "ecode": "1203230000030001",
                    "intro": "AMS4 Slot4 filament has run out. Purging the old filament; please wait."
                },
                {
                    "ecode": "1200200000030002",
                    "intro": "AMS1 Slot1 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "1201200000030002",
                    "intro": "AMS2 Slot1 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "1202200000030002",
                    "intro": "AMS3 Slot1 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "1203200000030002",
                    "intro": "AMS4 Slot1 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "1200210000030002",
                    "intro": "AMS1 Slot2 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "1201210000030002",
                    "intro": "AMS2 Slot2 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "1202210000030002",
                    "intro": "AMS3 Slot2 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "1203210000030002",
                    "intro": "AMS4 Slot2 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "1200220000030002",
                    "intro": "AMS1 Slot3 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "1201220000030002",
                    "intro": "AMS2 Slot3 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "1202220000030002",
                    "intro": "AMS3 Slot3 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "1203220000030002",
                    "intro": "AMS4 Slot3 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "1200230000030002",
                    "intro": "AMS1 Slot4 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "1201230000030002",
                    "intro": "AMS2 Slot4 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "1202230000030002",
                    "intro": "AMS3 Slot4 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "1203230000030002",
                    "intro": "AMS4 Slot4 filament has run out and automatically switched to the slot with the same filament."
                },
                {
                    "ecode": "1200240000020001",
                    "intro": "Filament may be broken in the tool head."
                },
                {
                    "ecode": "1200250000020001",
                    "intro": "Failed to extrude the filament and the extruder may be clogged."
                },
                {
                    "ecode": "1200300000010001",
                    "intro": "AMS1 Slot1 RFID coil is broken or the RF hardware circuit has an error."
                },
                {
                    "ecode": "1201300000010001",
                    "intro": "AMS2 Slot1 RFID coil is broken or the RF hardware circuit has an error."
                },
                {
                    "ecode": "1202300000010001",
                    "intro": "AMS3 Slot1 RFID coil is broken or the RF hardware circuit has an error."
                },
                {
                    "ecode": "1203300000010001",
                    "intro": "AMS4 Slot1 RFID coil is broken or the RF hardware circuit has an error."
                },
                {
                    "ecode": "1200310000010001",
                    "intro": "AMS1 Slot2 RFID coil is broken or the RF hardware circuit has an error."
                },
                {
                    "ecode": "1201310000010001",
                    "intro": "AMS2 Slot2 RFID coil is broken or the RF hardware circuit has an error."
                },
                {
                    "ecode": "1202310000010001",
                    "intro": "AMS3 Slot2 RFID coil is broken or the RF hardware circuit has an error."
                },
                {
                    "ecode": "1203310000010001",
                    "intro": "AMS4 Slot2 RFID coil is broken or the RF hardware circuit has an error."
                },
                {
                    "ecode": "1200320000010001",
                    "intro": "AMS1 Slot3 RFID coil is broken or the RF hardware circuit has an error."
                },
                {
                    "ecode": "1201320000010001",
                    "intro": "AMS2 Slot3 RFID coil is broken or the RF hardware circuit has an error."
                },
                {
                    "ecode": "1202320000010001",
                    "intro": "AMS3 Slot3 RFID coil is broken or the RF hardware circuit has an error."
                },
                {
                    "ecode": "1203320000010001",
                    "intro": "AMS4 Slot3 RFID coil is broken or the RF hardware circuit has an error."
                },
                {
                    "ecode": "1200330000010001",
                    "intro": "AMS1 Slot4 RFID coil is broken or the RF hardware circuit has an error."
                },
                {
                    "ecode": "1201330000010001",
                    "intro": "AMS2 Slot4 RFID coil is broken or the RF hardware circuit has an error."
                },
                {
                    "ecode": "1202330000010001",
                    "intro": "AMS3 Slot4 RFID coil is broken or the RF hardware circuit has an error."
                },
                {
                    "ecode": "1203330000010001",
                    "intro": "AMS4 Slot4 RFID coil is broken or the RF hardware circuit has an error."
                },
                {
                    "ecode": "1200300000020002",
                    "intro": "The RFID-tag on AMS1 Slot1 is damaged."
                },
                {
                    "ecode": "1201300000020002",
                    "intro": "The RFID-tag on AMS2 Slot1 is damaged."
                },
                {
                    "ecode": "1202300000020002",
                    "intro": "The RFID-tag on AMS3 Slot1 is damaged."
                },
                {
                    "ecode": "1203300000020002",
                    "intro": "The RFID-tag on AMS4 Slot1 is damaged."
                },
                {
                    "ecode": "1200310000020002",
                    "intro": "The RFID-tag on AMS1 Slot2 is damaged."
                },
                {
                    "ecode": "1201310000020002",
                    "intro": "The RFID-tag on AMS2 Slot2 is damaged."
                },
                {
                    "ecode": "1202310000020002",
                    "intro": "The RFID-tag on AMS3 Slot2 is damaged."
                },
                {
                    "ecode": "1203310000020002",
                    "intro": "The RFID-tag on AMS4 Slot2 is damaged."
                },
                {
                    "ecode": "1200320000020002",
                    "intro": "The RFID-tag on AMS1 Slot3 is damaged."
                },
                {
                    "ecode": "1201320000020002",
                    "intro": "The RFID-tag on AMS2 Slot3 is damaged."
                },
                {
                    "ecode": "1202320000020002",
                    "intro": "The RFID-tag on AMS3 Slot3 is damaged."
                },
                {
                    "ecode": "1203320000020002",
                    "intro": "The RFID-tag on AMS4 Slot3 is damaged."
                },
                {
                    "ecode": "1200330000020002",
                    "intro": "The RFID-tag on AMS1 Slot4 is damaged."
                },
                {
                    "ecode": "1201330000020002",
                    "intro": "The RFID-tag on AMS2 Slot4 is damaged."
                },
                {
                    "ecode": "1202330000020002",
                    "intro": "The RFID-tag on AMS3 Slot4 is damaged."
                },
                {
                    "ecode": "1203330000020002",
                    "intro": "The RFID-tag on AMS4 Slot4 is damaged."
                },
                {
                    "ecode": "1200300000030003",
                    "intro": "AMS1 Slot1 RFID cannot be read because of a structural error."
                },
                {
                    "ecode": "1201300000030003",
                    "intro": "AMS2 Slot1 RFID cannot be read because of a structural error."
                },
                {
                    "ecode": "1202300000030003",
                    "intro": "AMS3 Slot1 RFID cannot be read because of a structural error."
                },
                {
                    "ecode": "1203300000030003",
                    "intro": "AMS4 Slot1 RFID cannot be read because of a structural error."
                },
                {
                    "ecode": "1200310000030003",
                    "intro": "AMS1 Slot2 RFID cannot be read because of a structural error."
                },
                {
                    "ecode": "1201310000030003",
                    "intro": "AMS2 Slot2 RFID cannot be read because of a structural error."
                },
                {
                    "ecode": "1202310000030003",
                    "intro": "AMS3 Slot2 RFID cannot be read because of a structural error."
                },
                {
                    "ecode": "1203310000030003",
                    "intro": "AMS4 Slot2 RFID cannot be read because of a structural error."
                },
                {
                    "ecode": "1200320000030003",
                    "intro": "AMS1 Slot3 RFID cannot be read because of a structural error."
                },
                {
                    "ecode": "1201320000030003",
                    "intro": "AMS2 Slot3 RFID cannot be read because of a structural error."
                },
                {
                    "ecode": "1202320000030003",
                    "intro": "AMS3 Slot3 RFID cannot be read because of a structural error."
                },
                {
                    "ecode": "1203320000030003",
                    "intro": "AMS4 Slot3 RFID cannot be read because of a structural error."
                },
                {
                    "ecode": "1200330000030003",
                    "intro": "AMS1 Slot4 RFID cannot be read because of a structural error."
                },
                {
                    "ecode": "1201330000030003",
                    "intro": "AMS2 Slot4 RFID cannot be read because of a structural error."
                },
                {
                    "ecode": "1202330000030003",
                    "intro": "AMS3 Slot4 RFID cannot be read because of a structural error."
                },
                {
                    "ecode": "1203330000030003",
                    "intro": "AMS4 Slot4 RFID cannot be read because of a structural error."
                },
                {
                    "ecode": "1200300000010004",
                    "intro": "RFID cannot be read because of an encryption chip failure in AMS1."
                },
                {
                    "ecode": "1201300000010004",
                    "intro": "RFID cannot be read because of an encryption chip failure in AMS2."
                },
                {
                    "ecode": "1202300000010004",
                    "intro": "RFID cannot be read because of an encryption chip failure in AMS3."
                },
                {
                    "ecode": "1203300000010004",
                    "intro": "RFID cannot be read because of an encryption chip failure in AMS4."
                },
                {
                    "ecode": "1200450000020001",
                    "intro": "The filament cutter sensor is malfunctioning. Please check whether the connector is properly plugged in."
                },
                {
                    "ecode": "1200450000020002",
                    "intro": "The filament cutter's cutting distance is too large. The X motor may lose steps."
                },
                {
                    "ecode": "1200450000020003",
                    "intro": "The filament cutter handle has not released. The handle or blade may be stuck."
                },
                {
                    "ecode": "1200500000020001",
                    "intro": "AMS1 communication is abnormal; please check the connection cable."
                },
                {
                    "ecode": "1201500000020001",
                    "intro": "AMS2 communication is abnormal; please check the connection cable."
                },
                {
                    "ecode": "1202500000020001",
                    "intro": "AMS3 communication is abnormal; please check the connection cable."
                },
                {
                    "ecode": "1203500000020001",
                    "intro": "AMS4 communication is abnormal; please check the connection cable."
                },
                {
                    "ecode": "1200510000030001",
                    "intro": "AMS is disabled; please load filament from spool holder."
                },
                {
                    "ecode": "1200700000010001",
                    "intro": "AMS1 Filament speed and length error: The slot 1 filament odometry may be faulty."
                },
                {
                    "ecode": "1201700000010001",
                    "intro": "AMS2 Filament speed and length error: The slot 1 filament odometry may be faulty."
                },
                {
                    "ecode": "1202700000010001",
                    "intro": "AMS3 Filament speed and length error: The slot 1 filament odometry may be faulty."
                },
                {
                    "ecode": "1203700000010001",
                    "intro": "AMS4 Filament speed and length error: The slot 1 filament odometry may be faulty."
                },
                {
                    "ecode": "1200710000010001",
                    "intro": "AMS1 Filament speed and length error: The slot 2 filament odometry may be faulty."
                },
                {
                    "ecode": "1201710000010001",
                    "intro": "AMS2 Filament speed and length error: The slot 2 filament odometry may be faulty."
                },
                {
                    "ecode": "1202710000010001",
                    "intro": "AMS3 Filament speed and length error: The slot 2 filament odometry may be faulty."
                },
                {
                    "ecode": "1203710000010001",
                    "intro": "AMS4 Filament speed and length error: The slot 2 filament odometry may be faulty."
                },
                {
                    "ecode": "1200720000010001",
                    "intro": "AMS1 Filament speed and length error: The slot 3 filament odometry may be faulty."
                },
                {
                    "ecode": "1201720000010001",
                    "intro": "AMS2 Filament speed and length error: The slot 3 filament odometry may be faulty."
                },
                {
                    "ecode": "1202720000010001",
                    "intro": "AMS3 Filament speed and length error: The slot 3 filament odometry may be faulty."
                },
                {
                    "ecode": "1203720000010001",
                    "intro": "AMS4 Filament speed and length error: The slot 3 filament odometry may be faulty."
                },
                {
                    "ecode": "1200730000010001",
                    "intro": "AMS1 Filament speed and length error: The slot 4 filament odometry may be faulty."
                },
                {
                    "ecode": "1201730000010001",
                    "intro": "AMS2 Filament speed and length error: The slot 4 filament odometry may be faulty."
                },
                {
                    "ecode": "1202730000010001",
                    "intro": "AMS3 Filament speed and length error: The slot 4 filament odometry may be faulty."
                },
                {
                    "ecode": "1203730000010001",
                    "intro": "AMS4 Filament speed and length error: The slot 4 filament odometry may be faulty."
                },
                {
                    "ecode": "12FF200000020005",
                    "intro": "Filament may be broken in the tool head."
                },
                {
                    "ecode": "12FF200000020006",
                    "intro": "Failed to extrude the filament and the extruder may be clogged."
                },
                {
                    "ecode": "0C0003000002000F",
                    "intro": "Parts skip setted before first layer inspection, the inspection will not be supported for the current print job."
                },
                {
                    "ecode": "0500040000020010",
                    "intro": "The RFID-tag on AMS1 Slot1 cannot be identified."
                },
                {
                    "ecode": "0500040000020011",
                    "intro": "The RFID-tag on AMS1 Slot2 cannot be identified."
                },
                {
                    "ecode": "0500040000020012",
                    "intro": "The RFID-tag on AMS1 Slot3 cannot be identified."
                },
                {
                    "ecode": "0500040000020014",
                    "intro": "The RFID-tag on AMS2 Slot1 cannot be identified."
                },
                {
                    "ecode": "0500040000020015",
                    "intro": "The RFID-tag on AMS2 Slot2 cannot be identified."
                },
                {
                    "ecode": "0500040000020016",
                    "intro": "The RFID-tag on AMS2 Slot3 cannot be identified."
                },
                {
                    "ecode": "0500040000020017",
                    "intro": "The RFID-tag on AMS2 Slot4 cannot be identified."
                },
                {
                    "ecode": "0500040000020018",
                    "intro": "The RFID-tag on AMS3 Slot1 cannot be identified."
                },
                {
                    "ecode": "0500040000020019",
                    "intro": "The RFID-tag on AMS3 Slot2 cannot be identified."
                },
                {
                    "ecode": "050004000002001A",
                    "intro": "The RFID-tag on AMS3 Slot3 cannot be identified."
                },
                {
                    "ecode": "050004000002001B",
                    "intro": "The RFID-tag on AMS3 Slot4 cannot be identified."
                },
                {
                    "ecode": "050004000002001C",
                    "intro": "The RFID-tag on AMS4 Slot1 cannot be identified."
                },
                {
                    "ecode": "050004000002001D",
                    "intro": "The RFID-tag on AMS4 Slot2 cannot be identified."
                },
                {
                    "ecode": "050004000002001E",
                    "intro": "The RFID-tag on AMS4 Slot3 cannot be identified."
                },
                {
                    "ecode": "050004000002001F",
                    "intro": "The RFID-tag on AMS4 Slot4 cannot be identified."
                },
                {
                    "ecode": "0500040000020013",
                    "intro": "The RFID-tag on AMS1 Slot4 cannot be identified."
                },
                {
                    "ecode": "12FF800000020001",
                    "intro": "The filament on the spool holder may be tangled or stuck."
                },
                {
                    "ecode": "1200800000020001",
                    "intro": "AMS1 Slot1 filament may be tangled or stuck."
                },
                {
                    "ecode": "1200810000020001",
                    "intro": "AMS1 Slot2 filament may be tangled or stuck."
                },
                {
                    "ecode": "1200820000020001",
                    "intro": "AMS1 Slot3 filament may be tangled or stuck."
                },
                {
                    "ecode": "1200830000020001",
                    "intro": "AMS1 Slot4 filament may be tangled or stuck."
                },
                {
                    "ecode": "1201800000020001",
                    "intro": "AMS2 Slot1 filament may be tangled or stuck."
                },
                {
                    "ecode": "1201810000020001",
                    "intro": "AMS2 Slot2 filament may be tangled or stuck."
                },
                {
                    "ecode": "1201820000020001",
                    "intro": "AMS2 Slot3 filament may be tangled or stuck."
                },
                {
                    "ecode": "1201830000020001",
                    "intro": "AMS2 Slot4 filament may be tangled or stuck."
                },
                {
                    "ecode": "1202800000020001",
                    "intro": "AMS3 Slot1 filament may be tangled or stuck."
                },
                {
                    "ecode": "1202810000020001",
                    "intro": "AMS3 Slot2 filament may be tangled or stuck."
                },
                {
                    "ecode": "1202820000020001",
                    "intro": "AMS3 Slot3 filament may be tangled or stuck."
                },
                {
                    "ecode": "1202830000020001",
                    "intro": "AMS3 Slot4 filament may be tangled or stuck."
                },
                {
                    "ecode": "1203800000020001",
                    "intro": "AMS4 Slot1 filament may be tangled or stuck."
                },
                {
                    "ecode": "1203810000020001",
                    "intro": "AMS4 Slot2 filament may be tangled or stuck."
                },
                {
                    "ecode": "1203820000020001",
                    "intro": "AMS4 Slot3 filament may be tangled or stuck."
                },
                {
                    "ecode": "1203830000020001",
                    "intro": "AMS4 Slot4 filament may be tangled or stuck."
                },
                {
                    "ecode": "0300170000010001",
                    "intro": "The speed of the hotend fan is too slow or stopped. It may be stuck or the connector may not be plugged in properly."
                },
                {
                    "ecode": "0300170000020002",
                    "intro": "The speed of the hotend fan is slow. It may be stuck and need cleaning."
                },
                {
                    "ecode": "0300900000010001",
                    "intro": "Chamber heating failed. The chamber heater may be failing to blow hot air."
                },
                {
                    "ecode": "0300900000010002",
                    "intro": "Chamber heating failed. The chamber may not be enclosed, or the ambient temperature may be too low, or the heat dissipation vent of the power supply may be blocked."
                },
                {
                    "ecode": "0300900000010003",
                    "intro": "Chamber heating failed. The temperature of power supply may be too high."
                },
                {
                    "ecode": "0300900000010004",
                    "intro": "Chamber heating failed. The speed of the heating fan is too low."
                },
                {
                    "ecode": "0300900000010005",
                    "intro": "Chamber heating failed. The thermal resistance is too high."
                },
                {
                    "ecode": "0300910000010001",
                    "intro": "The temperature of chamber heater 1 is abnormal. The heater may have a short circuit."
                },
                {
                    "ecode": "0300910000010002",
                    "intro": "The temperature of chamber heater 1 is abnormal. The heater may have an open circuit or the thermal fuse may have taken effect."
                },
                {
                    "ecode": "0300910000010003",
                    "intro": "The temperature of chamber heater 1 is abnormal. The heater is over temperature."
                },
                {
                    "ecode": "0300910000010006",
                    "intro": "The temperature of chamber heater 1 is abnormal. The sensor may have a short circuit."
                },
                {
                    "ecode": "0300910000010007",
                    "intro": "The temperature of chamber heater 1 is abnormal. The sensor may have an open circuit."
                },
                {
                    "ecode": "0300910000010008",
                    "intro": "Chamber heater 1 failed to rise to target temperature."
                },
                {
                    "ecode": "0300920000010001",
                    "intro": "The temperature of chamber heater 2 is abnormal. The heater may have a short circuit."
                },
                {
                    "ecode": "0300920000010002",
                    "intro": "The temperature of chamber heater 2 is abnormal. The heater may have an open circuit or the thermal fuse may be in effect."
                },
                {
                    "ecode": "0300920000010003",
                    "intro": "The temperature of chamber heater 2 is abnormal. The heater is over temperature."
                },
                {
                    "ecode": "0300920000010006",
                    "intro": "The temperature of chamber heater 2 is abnormal. The sensor may have a short circuit."
                },
                {
                    "ecode": "0300920000010007",
                    "intro": "The temperature of chamber heater 2 is abnormal. The sensor may have an open circuit."
                },
                {
                    "ecode": "0300920000010008",
                    "intro": "Chamber heater 2 failed to rise to target temperature."
                },
                {
                    "ecode": "0300930000010001",
                    "intro": "Chamber temperature is abnormal. The chamber heater's temperature sensor may have a short circuit."
                },
                {
                    "ecode": "0300930000010002",
                    "intro": "Chamber temperature is abnormal. The chamber heater's temperature sensor may have an open circuit."
                },
                {
                    "ecode": "0300930000010003",
                    "intro": "Chamber temperature is abnormal. The chamber heater's temperature sensor at the air outlet may have a short circuit."
                },
                {
                    "ecode": "0300930000010004",
                    "intro": "Chamber temperature is abnormal. The chamber heater's temperature sensor at the air outlet may have an open circuit."
                },
                {
                    "ecode": "0300930000010005",
                    "intro": "Chamber temperature is abnormal. The chamber heater's temperature sensor at the air inlet may have a short circuit."
                },
                {
                    "ecode": "0300930000010006",
                    "intro": "Chamber temperature is abnormal. The chamber heater's temperature sensor at the air inlet may have an open circuit."
                },
                {
                    "ecode": "0300930000010007",
                    "intro": "Chamber temperature is abnormal. The temperature sensor at the power supply may have a short circuit."
                },
                {
                    "ecode": "0300930000010008",
                    "intro": "Chamber temperature is abnormal. The temperature sensor at power supply may have an open circuit."
                },
                {
                    "ecode": "0500030000010023",
                    "intro": "The CTC module is malfunctioning. Please restart the device."
                },
                {
                    "ecode": "0300900000010010",
                    "intro": "The communication of chamber temperature controller is abnormal."
                },
                {
                    "ecode": "12FF200000030007",
                    "intro": "Checking the filament location of all AMS slots, please wait."
                },
                {
                    "ecode": "0500040000020020",
                    "intro": ""
                },
                {
                    "ecode": "0300940000030001",
                    "intro": "Chamber cooling may be too slow. You can open the chamber to help cooling if the gas in chamber is non-toxic."
                },
                {
                    "ecode": "0300180000010001",
                    "intro": "The value of extrusion force sensor is low, the nozzle seems to not be installed."
                },
                {
                    "ecode": "0300180000010003",
                    "intro": "The extrusion force sensor is not available, the link between the MC and TH may be broken or the sensor is broken."
                },
                {
                    "ecode": "0300180000010004",
                    "intro": "The data from extrusion force sensor is abnormal, the sensor should be broken."
                },
                {
                    "ecode": "0300190000010001",
                    "intro": "The eddy current sensor on Y-axis is not available, the wire should be broken."
                },
                {
                    "ecode": "0300190000020002",
                    "intro": "The sensitivity of Y-axis eddy current sensor is too low."
                },
                {
                    "ecode": "0300940000030002",
                    "intro": "Chamber temperature setting value exceed the limit, the boundary value will be set."
                },
                {
                    "ecode": "12FF200000020007",
                    "intro": "Failed to check the filament location in the tool head."
                },
                {
                    "ecode": "0300180000010002",
                    "intro": "The sensitivity of the extrusion force sensor is low, the hotend may not installed correctly."
                },
                {
                    "ecode": "03001A0000020001",
                    "intro": "The nozzle is covered with filaments, or the build plate is put in crooked."
                },
                {
                    "ecode": "03001A0000020002",
                    "intro": "The nozzle is clogged with filament."
                },
                {
                    "ecode": "1200200000020006",
                    "intro": "Failed to extrude AMS1 Slot1 filament; the extruder may be clogged or the filament may be too thin, causing the extruder to slip."
                },
                {
                    "ecode": "1201200000020006",
                    "intro": "Failed to extrude AMS2 Slot1 filament; the extruder may be clogged or the filament may be too thin, causing the extruder to slip."
                },
                {
                    "ecode": "1202200000020006",
                    "intro": "Failed to extrude AMS3 Slot1 filament; the extruder may be clogged or the filament may be too thin, causing the extruder to slip."
                },
                {
                    "ecode": "1203200000020006",
                    "intro": "Failed to extrude AMS4 Slot1 filament; the extruder may be clogged or the filament may be too thin, causing the extruder to slip."
                },
                {
                    "ecode": "1200210000020006",
                    "intro": "Failed to extrude AMS1 Slot2 filament; the extruder may be clogged or the filament may be too thin, causing the extruder to slip."
                },
                {
                    "ecode": "1201210000020006",
                    "intro": "Failed to extrude AMS2 Slot2 filament; the extruder may be clogged or the filament may be too thin, causing the extruder to slip."
                },
                {
                    "ecode": "1202210000020006",
                    "intro": "Failed to extrude AMS3 Slot2 filament; the extruder may be clogged or the filament may be too thin, causing the extruder to slip."
                },
                {
                    "ecode": "1203210000020006",
                    "intro": "Failed to extrude AMS4 Slot2 filament; the extruder may be clogged or the filament may be too thin, causing the extruder to slip."
                },
                {
                    "ecode": "1200220000020006",
                    "intro": "Failed to extrude AMS1 Slot3 filament; the extruder may be clogged or the filament may be too thin, causing the extruder to slip."
                },
                {
                    "ecode": "1201220000020006",
                    "intro": "Failed to extrude AMS2 Slot3 filament; the extruder may be clogged or the filament may be too thin, causing the extruder to slip."
                },
                {
                    "ecode": "1202220000020006",
                    "intro": "Failed to extrude AMS3 Slot3 filament; the extruder may be clogged or the filament may be too thin, causing the extruder to slip."
                },
                {
                    "ecode": "1203220000020006",
                    "intro": "Failed to extrude AMS4 Slot3 filament; the extruder may be clogged or the filament may be too thin, causing the extruder to slip."
                },
                {
                    "ecode": "1200230000020006",
                    "intro": "Failed to extrude AMS1 Slot4 filament; the extruder may be clogged or the filament may be too thin, causing the extruder to slip."
                },
                {
                    "ecode": "1201230000020006",
                    "intro": "Failed to extrude AMS2 Slot4 filament; the extruder may be clogged or the filament may be too thin, causing the extruder to slip."
                },
                {
                    "ecode": "1202230000020006",
                    "intro": "Failed to extrude AMS3 Slot4 filament; the extruder may be clogged or the filament may be too thin, causing the extruder to slip."
                },
                {
                    "ecode": "1203230000020006",
                    "intro": "Failed to extrude AMS4 Slot4 filament; the extruder may be clogged or the filament may be too thin, causing the extruder to slip."
                },
                {
                    "ecode": "0300020000010009",
                    "intro": "The nozzle temperature control is abnormal; the hot end may not be installed. If you want to heat the hot end without it being installed, please turn on maintenance mode on the settings page."
                },
                {
                    "ecode": "0300940000020003",
                    "intro": "Chamber failed to reach the desired temperature. The machine will stop waiting for the chamber temperature."
                },
                {
                    "ecode": "0C00030000020010",
                    "intro": "Foreign objects detected on hotbed, Please check and clean the hotbed."
                },
                {
                    "ecode": "0500050000010001",
                    "intro": "The factory data of AP board is abnormal, please replace the AP board with a new one."
                }
            ]
        },
        "device_error": {
            "ver": 202311050300,
            "en": [
                {
                    "ecode": "03004000",
                    "intro": "Z轴回零失败，打印已停止。"
                },
                {
                    "ecode": "03004001",
                    "intro": "工具头降温超时。"
                },
                {
                    "ecode": "03004002",
                    "intro": "热床调平失败，打印已停止。"
                },
                {
                    "ecode": "03004003",
                    "intro": "Nozzle temperature malfunction."
                },
                {
                    "ecode": "03004004",
                    "intro": "Heatbed temperature malfunction."
                },
                {
                    "ecode": "03004005",
                    "intro": "喷嘴风扇转速异常。"
                },
                {
                    "ecode": "03004006",
                    "intro": "喷嘴堵头。"
                },
                {
                    "ecode": "03004008",
                    "intro": "AMS换料失败。"
                },
                {
                    "ecode": "03004009",
                    "intro": "XY回零失败。"
                },
                {
                    "ecode": "0300400A",
                    "intro": "振动扫频识别失败。"
                },
                {
                    "ecode": "0300400B",
                    "intro": "内部通讯异常。"
                },
                {
                    "ecode": "0300400C",
                    "intro": "打印已取消。"
                },
                {
                    "ecode": "0300400D",
                    "intro": "断电续打失败。"
                },
                {
                    "ecode": "03008000",
                    "intro": "未知原因暂停。你可以点击“继续打印”来恢复打印任务。"
                },
                {
                    "ecode": "03008001",
                    "intro": "用户暂停。你可以点击“继续打印”来恢复打印任务。"
                },
                {
                    "ecode": "03008002",
                    "intro": "激光雷达检测到首层缺陷,请检查打印件状况后决定是否继续。"
                },
                {
                    "ecode": "03008003",
                    "intro": "AI打印监控检测到炒面缺陷。请检查打印件状况后做相应处理。"
                },
                {
                    "ecode": "03008004",
                    "intro": "打印耗材用尽，请加载新料。"
                },
                {
                    "ecode": "03008005",
                    "intro": "工具头前盖掉落。请把前盖重新装上，并检查打印件是否完好。"
                },
                {
                    "ecode": "03008006",
                    "intro": "未检测到打印板定位标识。请检查打印板是否放置且四角对齐，并保证定位标识清晰无磨损。"
                },
                {
                    "ecode": "05004001",
                    "intro": "无法连接服务器，请检查网络连接。"
                },
                {
                    "ecode": "05004002",
                    "intro": "不支持的打印文件路径或者名称，请重新发起打印。"
                },
                {
                    "ecode": "05004003",
                    "intro": "解析gcode.3mf遇到问题，打印已停止。请重新发送打印。"
                },
                {
                    "ecode": "05004004",
                    "intro": "打印过程中无法启动新的打印，请在当前打印任务结束后再发送新的打印。"
                },
                {
                    "ecode": "05004005",
                    "intro": "不允许在固件更新过程中发送打印任务。"
                },
                {
                    "ecode": "05004006",
                    "intro": "内部存储空间不足，可恢复出厂设置以释放所有可用空间。"
                },
                {
                    "ecode": "05004007",
                    "intro": "需要修复升级和强制升级，不允许打印。"
                },
                {
                    "ecode": "05004008",
                    "intro": "启动打印失败，请重启机器并重新发送打印。"
                },
                {
                    "ecode": "07008001",
                    "intro": "检测到切料失败，请检查切刀，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07008002",
                    "intro": "检测到切刀卡住，请拨出刀柄后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07008003",
                    "intro": "耗材退出挤出机失败，可能堵头或耗材卡在挤出机内部。"
                },
                {
                    "ecode": "07008004",
                    "intro": "耗材从工具头退回AMS失败。可能是因为料盘卡住，或者耗材的端头卡在路径中。"
                },
                {
                    "ecode": "07008005",
                    "intro": "耗材无法从AMS送往打印机。请取出耗材后，剪平料头重新插入。如果异常继续，请检查AMS内部特氟龙管有无磨损。"
                },
                {
                    "ecode": "07008006",
                    "intro": "耗材送往挤出机失败。可能是因为耗材缠住或料盘卡住，也可能是AMS特氟龙管未接上。"
                },
                {
                    "ecode": "07008007",
                    "intro": "耗材挤出失败，请检查挤出机是否堵塞。"
                },
                {
                    "ecode": "07008010",
                    "intro": "AMS助力电机过载，可能是因为耗材缠住或料盘卡住。"
                },
                {
                    "ecode": "07008011",
                    "intro": "AMS耗材用尽。请把耗材放入同一个AMS槽位后继续。"
                },
                {
                    "ecode": "07018001",
                    "intro": "检测到切料失败，请检查切刀，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07018002",
                    "intro": "检测到切刀卡住，请拨出刀柄后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07018003",
                    "intro": "耗材退出挤出机失败，可能由于堵头或者耗材断在挤出机内部。"
                },
                {
                    "ecode": "07018004",
                    "intro": "耗材从工具头退回AMS失败。可能是因为料盘卡住，或者耗材的端头卡在路径中。"
                },
                {
                    "ecode": "07018005",
                    "intro": "耗材无法从AMS送往打印机。请取出耗材后，剪平料头重新插入。如果异常继续，请检查AMS内部特氟龙管有无磨损。"
                },
                {
                    "ecode": "07018006",
                    "intro": "耗材送往挤出机失败。可能是因为耗材缠住或料盘卡住。"
                },
                {
                    "ecode": "07018007",
                    "intro": "料线挤出异常，请检查挤出机是否堵塞，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07018010",
                    "intro": "AMS助力电机过载，可能是因为耗材缠住或料盘卡住。"
                },
                {
                    "ecode": "07018011",
                    "intro": "AMS耗材用尽。请把耗材放入同一个AMS槽位后继续。"
                },
                {
                    "ecode": "07028001",
                    "intro": "检测到切料失败，请检查切刀，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07028002",
                    "intro": "检测到切刀卡住，请拨出刀柄后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07028003",
                    "intro": "料线退出挤出机失败，请检查是否发生堵头或者料线是否断在挤出机内部。排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07028004",
                    "intro": "料线从工具头退回AMS失败，请检查料线或料盘是否卡住，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07028005",
                    "intro": "料线送出AMS失败，请剪平料头、检查料盘是否卡住后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07028006",
                    "intro": "料线送往挤出机失败，请检查料线或料盘是否卡住，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07028007",
                    "intro": "料线挤出失败，请检查挤出机是否堵塞，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07028010",
                    "intro": "AMS助力电机过载，请检查料盘或料线是否卡住，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07028011",
                    "intro": "AMS耗材用尽。请把耗材放入同一个AMS槽位后继续。"
                },
                {
                    "ecode": "07038001",
                    "intro": "检测到切料失败，请检查切刀，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07038002",
                    "intro": "检测到切刀卡住，请拨出刀柄后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07038003",
                    "intro": "料线退出挤出机失败，请检查是否发生堵头或者料线是否断在挤出机内部。排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07038004",
                    "intro": "料线从工具头退回AMS失败，请检查料线或料盘是否卡住，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07038005",
                    "intro": "料线送出AMS失败，请剪平料头、检查料盘是否卡住后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07038006",
                    "intro": "料线送往挤出机失败，请检查料线或料盘是否卡住，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07038007",
                    "intro": "料线挤出失败，请检查挤出机是否堵塞，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07038010",
                    "intro": "AMS助力电机过载，请检查料盘或料线是否卡住，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07038011",
                    "intro": "AMS耗材用尽。请把耗材放入同一个AMS槽位后继续。"
                },
                {
                    "ecode": "0C008001",
                    "intro": "检测到首层打印的缺陷。如果可以接受此缺陷，可点击“继续打印”按钮恢复打印任务。"
                },
                {
                    "ecode": "0C008002",
                    "intro": "检测到打印炒面问题。"
                },
                {
                    "ecode": "0C00C003",
                    "intro": "检测到首层可能存在打印瑕疵。"
                },
                {
                    "ecode": "0C00C004",
                    "intro": "检测到可能发生了打印炒面失败问题。"
                },
                {
                    "ecode": "03008007",
                    "intro": "检测到断电时有未完成的打印任务。如果模型仍然粘接在底板上，可尝试继续打印。"
                },
                {
                    "ecode": "03008008",
                    "intro": "喷嘴温控故障，打印已停止。"
                },
                {
                    "ecode": "03008009",
                    "intro": "热床温控故障。"
                },
                {
                    "ecode": "05004009",
                    "intro": "不允许在日志上传过程中发送打印任务。"
                },
                {
                    "ecode": "0500400A",
                    "intro": "文件名不支持，请修改文件名并重新发送打印。"
                },
                {
                    "ecode": "0300800A",
                    "intro": "AI打印监控检测到垃圾桶处废料堆积，请及时清理。"
                },
                {
                    "ecode": "0C008005",
                    "intro": "检测到垃圾桶废料堆积，可能导致工具头撞料。"
                },
                {
                    "ecode": "0C00C006",
                    "intro": "检测到可能发生垃圾桶堆料问题。"
                },
                {
                    "ecode": "0300400E",
                    "intro": "电机参数自检失败。"
                },
                {
                    "ecode": "0300800B",
                    "intro": "切刀已卡住，请确保切刀刀柄弹回。"
                },
                {
                    "ecode": "07008012",
                    "intro": "多次获取AMS映射表失败，请点击\"重试\"继续。"
                },
                {
                    "ecode": "07018012",
                    "intro": "多次获取AMS映射表失败，请点击\"重试\"继续。"
                },
                {
                    "ecode": "07028012",
                    "intro": "多次获取AMS映射表失败，请点击\"重试\"继续。"
                },
                {
                    "ecode": "07038012",
                    "intro": "多次获取AMS映射表失败，请点击\"重试\"继续。"
                },
                {
                    "ecode": "07008013",
                    "intro": "检测到冲刷旧料超时，请检查料线是否卡住或挤出机堵头，排除异常后点击\"重试\"继续。"
                },
                {
                    "ecode": "07018013",
                    "intro": "检测到冲刷旧料超时，请检查料线是否卡住或挤出机堵头，排除异常后点击\"重试\"继续。"
                },
                {
                    "ecode": "07028013",
                    "intro": "检测到冲刷旧料超时，请检查料线是否卡住或挤出机堵头，排除异常后点击\"重试\"继续。"
                },
                {
                    "ecode": "07038013",
                    "intro": "检测到冲刷旧料超时，请检查料线是否卡住或挤出机堵头，排除异常后点击\"重试\"继续。"
                },
                {
                    "ecode": "07004001",
                    "intro": "检测到禁用AMS时仍从AMS加载料，请将耗材退回AMS并从料盘支架加载新料后重新发起打印。"
                },
                {
                    "ecode": "07014001",
                    "intro": "检测到禁用AMS时仍从AMS加载料，请将耗材退回AMS并从料盘支架加载新料后重新发起打印。"
                },
                {
                    "ecode": "07024001",
                    "intro": "检测到禁用AMS时仍从AMS加载料，请将耗材退回AMS并从料盘支架加载新料后重新发起打印。"
                },
                {
                    "ecode": "07034001",
                    "intro": "检测到禁用AMS时仍从AMS加载料，请将耗材退回AMS并从料盘支架加载新料后重新发起打印。"
                },
                {
                    "ecode": "0500400B",
                    "intro": "文件下载错误，请检查网络并重新发送打印。"
                },
                {
                    "ecode": "1000C001",
                    "intro": "热床温度较高，可能造成耗材软化堵头。请注意打印机的开放通风。"
                },
                {
                    "ecode": "1000C002",
                    "intro": "用不锈钢喷嘴打印碳纤维料可能造成喷嘴损坏。"
                },
                {
                    "ecode": "0500400C",
                    "intro": "请插入MicroSD卡，重新发送打印。"
                },
                {
                    "ecode": "0500400D",
                    "intro": "请运行自检后重新启动打印作业。"
                },
                {
                    "ecode": "0300800C",
                    "intro": "检测到丢步并自动恢复，请继续打印并观察后续打印是否有错层现象。"
                },
                {
                    "ecode": "0C008009",
                    "intro": "未检测到打印板定位标识。"
                },
                {
                    "ecode": "0500400E",
                    "intro": "打印已取消。"
                },
                {
                    "ecode": "0300800D",
                    "intro": "检测到有打印件倒塌或喷嘴没有正常挤出。如果缺陷可接受，可点击\"继续打印\"按钮来恢复打印任务。"
                },
                {
                    "ecode": "07FF8001",
                    "intro": "检测到切料失败，请检查切刀，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07FF8002",
                    "intro": "检测到切刀卡住，请拨出刀柄后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07FF8003",
                    "intro": "请将外挂料盘的耗材拉出。如果该消息重复出现，请检查是否有耗材断在工具头。(如后续使用AMS，请连接特氟龙管）"
                },
                {
                    "ecode": "07FF8004",
                    "intro": "料线从工具头退回AMS失败，请检查料线或料盘是否卡住，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07FF8005",
                    "intro": "料线送出AMS失败，请剪平料头、检查料盘是否卡住后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07FF8006",
                    "intro": "请把耗材插入进料口，直到推不动为止。"
                },
                {
                    "ecode": "07FF8007",
                    "intro": "请观察喷嘴，若耗材已被挤出，点击\"完成\"；若未被挤出，请往前轻推料线后点击\"重试\"。"
                },
                {
                    "ecode": "07FF8010",
                    "intro": "AMS助力电机过载，请检查料盘或料线是否卡住，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "07FF8011",
                    "intro": "AMS耗材用尽。请把耗材放入同一个AMS槽位后继续。"
                },
                {
                    "ecode": "07FF8012",
                    "intro": "多次获取AMS映射表失败，请点击\"重试\"继续。"
                },
                {
                    "ecode": "07FF8013",
                    "intro": "检测到冲刷旧料超时，请检查料线是否卡住或挤出机堵头，排除异常后点击\"重试\"继续。"
                },
                {
                    "ecode": "07FF4001",
                    "intro": "检测到禁用AMS时仍从AMS加载料，请将耗材退回AMS并从料盘支架加载新料后重新发起打印。"
                },
                {
                    "ecode": "0300800E",
                    "intro": "检测到打印文件不可用。请确认存储介质是否被移除。"
                },
                {
                    "ecode": "0500C010",
                    "intro": "SD卡读写异常，请重新插入或更换SD卡。"
                },
                {
                    "ecode": "0500C011",
                    "intro": ""
                },
                {
                    "ecode": "05004012",
                    "intro": "The door seems to be open, so printing was paused."
                },
                {
                    "ecode": "05008013",
                    "intro": "检测到打印文件不可用。请确认存储介质是否被移除。"
                },
                {
                    "ecode": "0300800F",
                    "intro": "检测到门已打开，暂停打印。"
                },
                {
                    "ecode": "05004014",
                    "intro": "云端切片发生错误，请检查切片参数并重新发起打印。"
                },
                {
                    "ecode": "03008010",
                    "intro": "热端风扇转速异常，打印已停止。"
                },
                {
                    "ecode": "07FFC003",
                    "intro": "请将外挂料盘的耗材拉出。如果该消息重复出现，请检查是否有耗材断在工具头。(如后续使用AMS，请连接特氟龙管）"
                },
                {
                    "ecode": "07FFC006",
                    "intro": "请把耗材插入进料口，直到推不动为止。"
                },
                {
                    "ecode": "05004015",
                    "intro": "设备存储空间不足以打印任务。请格式化或清理SD卡以释放可用空间。"
                },
                {
                    "ecode": "12008001",
                    "intro": "切料失败，请查看切刀是否卡住。可查看助手了解具体原因和解决方法。"
                },
                {
                    "ecode": "12018001",
                    "intro": "检测到切料失败，请检查切刀，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12028001",
                    "intro": "检测到切料失败，请检查切刀，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12038001",
                    "intro": "检测到切料失败，请检查切刀，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12FF8001",
                    "intro": "检测到切料失败，请检查切刀，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12008002",
                    "intro": "检测到切刀卡住，请拨出刀柄后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12018002",
                    "intro": "检测到切刀卡住，请拨出刀柄后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12028002",
                    "intro": "检测到切刀卡住，请拨出刀柄后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12038002",
                    "intro": "检测到切刀卡住，请拨出刀柄后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12FF8002",
                    "intro": "检测到切刀卡住，请拨出刀柄后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12008003",
                    "intro": "料线退出挤出机失败，请检查挤出机是否堵塞或料线是否断在挤出机内部。排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12018003",
                    "intro": "料线退出挤出机失败，请检查挤出机是否堵塞或料线是否断在挤出机内部。排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12028003",
                    "intro": "料线退出挤出机失败，请检查挤出机是否堵塞或料线是否断在挤出机内部。排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12038003",
                    "intro": "料线退出挤出机失败，请检查挤出机是否堵塞或料线是否断在挤出机内部。排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12FF8003",
                    "intro": "请将外挂料盘的耗材拉出。如果该消息重复出现，请检查是否有耗材断在工具头。(如后续使用AMS，请连接特氟龙管）"
                },
                {
                    "ecode": "12FFC003",
                    "intro": "请将外挂料盘的耗材拉出。如果该消息重复出现，请检查是否有耗材断在工具头。(如后续使用AMS，请连接特氟龙管）"
                },
                {
                    "ecode": "12008004",
                    "intro": "料线从工具头退回失败，请检查料线是否卡住，排除异常后点击\"重\"按钮。"
                },
                {
                    "ecode": "12018004",
                    "intro": "料线从工具头退回失败，请检查料线是否卡住，排除异常后点击\"重\"按钮。"
                },
                {
                    "ecode": "12028004",
                    "intro": "料线从工具头退回失败，请检查料线是否卡住，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12038004",
                    "intro": "料线从工具头退回失败，请检查料线是否卡住，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12FF8004",
                    "intro": "料线从工具头退回失败，请检查料线是否卡住，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12008005",
                    "intro": "请插入料线后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12018005",
                    "intro": "请插入料线后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12028005",
                    "intro": "请插入料线后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12038005",
                    "intro": "请插入料线后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12FF8005",
                    "intro": "请插入料线后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12008006",
                    "intro": "料线送往挤出机失败，请检查料线是否卡住，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12018006",
                    "intro": "料线送往挤出机失败，请检查料线是否卡住，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12028006",
                    "intro": "料线送往挤出机失败，请检查料线是否卡住，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12038006",
                    "intro": "料线送往挤出机失败，请检查料线是否卡住，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12FF8006",
                    "intro": "请把耗材插入进料口，直到推不动为止。"
                },
                {
                    "ecode": "12FFC006",
                    "intro": "请把耗材插入进料口，直到推不动为止。"
                },
                {
                    "ecode": "12008007",
                    "intro": "耗材挤出异常，可能由堵头或耗材卡住导致。"
                },
                {
                    "ecode": "12018007",
                    "intro": "料线挤出失败，请检查挤出机是否堵塞，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12028007",
                    "intro": "料线挤出失败，请检查挤出机是否堵塞，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12038007",
                    "intro": "料线挤出失败，请检查挤出机是否堵塞，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12FF8007",
                    "intro": "请观察喷嘴，若耗材已被挤出，点击完成;若未被挤出，请往前轻推料线后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12008010",
                    "intro": "耗材或者料盘可能卡住。"
                },
                {
                    "ecode": "12018010",
                    "intro": "请检查料盘或料线是否卡住，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12028010",
                    "intro": "请检查料盘或料线是否卡住，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12038010",
                    "intro": "请检查料盘或料线是否卡住，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12FF8010",
                    "intro": "请检查耗材或者料盘是否卡住。"
                },
                {
                    "ecode": "12008011",
                    "intro": "AMS耗材用尽。请把耗材放入同一个AMS槽位后继续。"
                },
                {
                    "ecode": "12018011",
                    "intro": "检测到AMS材料耗尽。请放新料线后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12028011",
                    "intro": "检测到AMS材料耗尽。请放新料线后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12038011",
                    "intro": "检测到AMS材料耗尽。请放新料线后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12FF8011",
                    "intro": "检测到AMS材料耗尽。请放新料线后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12008012",
                    "intro": "多次获取AMS映射表失败，请点击\"重试\"继续。"
                },
                {
                    "ecode": "12018012",
                    "intro": "多次获取AMS映射表失败，请点击\"重试\"继续。"
                },
                {
                    "ecode": "12028012",
                    "intro": "多次获取AMS映射表失败，请点击\"重试\"继续。"
                },
                {
                    "ecode": "12038012",
                    "intro": "多次获取AMS映射表失败，请点击\"重试\"继续。"
                },
                {
                    "ecode": "12FF8012",
                    "intro": "多次获取AMS映射表失败，请点击\"重试\"继续。"
                },
                {
                    "ecode": "12008013",
                    "intro": "检测到冲刷旧料超时，请检查料线是否卡住或挤出机堵头，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12018013",
                    "intro": "检测到冲刷旧料超时，请检查料线是否卡住或挤出机堵头，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12028013",
                    "intro": "检测到冲刷旧料超时，请检查料线是否卡住或挤出机堵头，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12038013",
                    "intro": "检测到冲刷旧料超时，请检查料线是否卡住或挤出机堵头，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12FF8013",
                    "intro": "检测到冲刷旧料超时，请检查料线是否卡住或挤出机堵头，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12004001",
                    "intro": "检测到禁用AMS时仍从AMS加载料，请将耗材退回AMS并从料盘支架加载新料后重新发起打印。"
                },
                {
                    "ecode": "12014001",
                    "intro": "检测到禁用AMS时仍从AMS加载料，请将耗材退回AMS并从料盘支架加载新料后重新发起打印。"
                },
                {
                    "ecode": "12024001",
                    "intro": "检测到禁用AMS时仍从AMS加载料，请将耗材退回AMS并从料盘支架加载新料后重新发起打印。"
                },
                {
                    "ecode": "12034001",
                    "intro": "检测到禁用AMS时仍从AMS加载料，请将耗材退回AMS并从料盘支架加载新料后重新发起打印。"
                },
                {
                    "ecode": "12FF4001",
                    "intro": "检测到禁用AMS时仍从AMS加载料，请将耗材退回AMS并从料盘支架加载新料后重新发起打印。"
                },
                {
                    "ecode": "12008014",
                    "intro": "无法检查工具头内部的耗材位置。可查看助手了解具体原因和解决方法。"
                },
                {
                    "ecode": "12018014",
                    "intro": "工具头内部料线位置检查失败，请查看HMS帮助，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12028014",
                    "intro": "工具头内部料线位置检查失败，请查看HMS帮助，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12038014",
                    "intro": "工具头内部料线位置检查失败，请查看HMS帮助，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "05004016",
                    "intro": "MicroSD卡进入写保护，请更换MicroSD卡。"
                },
                {
                    "ecode": "05004017",
                    "intro": "绑定操作失败，可重试或重启打印机后重试。"
                },
                {
                    "ecode": "05004018",
                    "intro": "绑定配置信息解析失败，请重试。"
                },
                {
                    "ecode": "05004019",
                    "intro": "打印机已经绑定。请解除绑定，然后重试。"
                },
                {
                    "ecode": "0500401A",
                    "intro": "云端访问失败，可能的原因是干扰导致网络不稳定，或不具备internet访问能力， 或路由器防火墙限制。可移动打印机到路由器附近 或检测路由器配置后重试。"
                },
                {
                    "ecode": "0500401B",
                    "intro": "云端访问返回值非法，如多次尝试失败请联系客服。"
                },
                {
                    "ecode": "0500401C",
                    "intro": "云端访问被拒绝，如多次尝试失败请联系客服。"
                },
                {
                    "ecode": "0500401D",
                    "intro": "云端访问失败，可能的原因是干扰导致网络不稳定，可移动打印机到路由器附近后重试。"
                },
                {
                    "ecode": "0500401E",
                    "intro": "云端访问返回值非法，如多次尝试失败请联系客服。"
                },
                {
                    "ecode": "0500401F",
                    "intro": "云端绑定授权超时，请检查手机或PC具备访问internet能力，并保证绑定操作时Bmabu Studio/Handy APP在前台执行。"
                },
                {
                    "ecode": "05004020",
                    "intro": "云端访问被拒绝，如多次尝试失败请联系客服。"
                },
                {
                    "ecode": "05004021",
                    "intro": "云端访问失败，可能的原因是干扰导致网络不稳定，可移动打印机到路由器附近后重试。"
                },
                {
                    "ecode": "05004022",
                    "intro": "云端访问返回值非法，如多次尝试失败请联系客服。"
                },
                {
                    "ecode": "05004023",
                    "intro": "云端访问被拒绝，如多次尝试失败请联系客服。"
                },
                {
                    "ecode": "05004024",
                    "intro": "云端访问失败，可能的原因是干扰导致网络不稳定，或不具备internel访问能力， 或路由器防火墙限制。可移动打印机到路由器附近 或检测路由器配置后重试。"
                },
                {
                    "ecode": "05004025",
                    "intro": "云端访问返回值非法，如多次尝试失败请联系客服。"
                },
                {
                    "ecode": "05004026",
                    "intro": "云端访问被拒绝，如多次尝试失败请联系客服。"
                },
                {
                    "ecode": "05004027",
                    "intro": "云端访问失败，可能的原因是干扰导致网络不稳定，可移动打印机到路由器附近后重试。"
                },
                {
                    "ecode": "05004028",
                    "intro": "云端访问返回值非法，如多次尝试失败请联系客服。"
                },
                {
                    "ecode": "05004029",
                    "intro": "云端访问被拒绝，如多次尝试失败请联系客服。"
                },
                {
                    "ecode": "0500402A",
                    "intro": "连接路由器失败，可能是无线环境干扰或距离路由器较远，可重试或移动打印机到路由器附近重试。"
                },
                {
                    "ecode": "0500402B",
                    "intro": "连接路由器密码错误，请检查密码后重试。"
                },
                {
                    "ecode": "0500402C",
                    "intro": "未成功获取IP地址，可能时无线环境干扰导致数据收发未成功或路由器DHCP地址池满，可移动打印机到路由器附近后重试。若多次失败需要检查路由器DHCP地址池是否已耗尽。"
                },
                {
                    "ecode": "03008011",
                    "intro": "检测到的打印板类型与切片G代码中不一致。请修改切片参数或者使用匹配的打印板。"
                },
                {
                    "ecode": "03008012",
                    "intro": ""
                },
                {
                    "ecode": "03008013",
                    "intro": "用户暂停。你可以点击“继续打印”来恢复打印任务。"
                },
                {
                    "ecode": "0500402D",
                    "intro": "系统发生异常。"
                },
                {
                    "ecode": "0C00800A",
                    "intro": "检测到的打印板类型与切片选择的打印板类型不一致。"
                },
                {
                    "ecode": "0500402E",
                    "intro": "系统不支持SD卡当前使用的文件系统，请更换SD卡或格式化该SD卡为FAT32格式。"
                },
                {
                    "ecode": "0500402F",
                    "intro": "SD卡扇区数据发生损坏，请使用SD卡修复工具进行修复或格式化，若仍无法识别，请更换SD卡。"
                },
                {
                    "ecode": "05008030",
                    "intro": ""
                },
                {
                    "ecode": "03008014",
                    "intro": "检测到挤出机裹料或构建板放歪，请根据实际状态，取消本次打印并清理挤出机或调整热床，或点击“继续打印”按钮恢复打印任务。"
                },
                {
                    "ecode": "03008015",
                    "intro": "打印耗材用尽，请在“耗材“页面加载新料。"
                },
                {
                    "ecode": "05014017",
                    "intro": "绑定操作失败，可重试或重启打印机后重试。"
                },
                {
                    "ecode": "05014018",
                    "intro": "绑定配置信息解析失败，请重试。"
                },
                {
                    "ecode": "05014019",
                    "intro": "打印机已经绑定。请解除绑定，然后重试。"
                },
                {
                    "ecode": "0501401A",
                    "intro": "云端访问失败，可能的原因是干扰导致网络不稳定，或不具备internet访问能力， 或路由器防火墙限制。可移动打印机到路由器附近 或检测路由器配置后重试。"
                },
                {
                    "ecode": "0501401B",
                    "intro": "云端访问返回值非法，如多次尝试失败请联系客服。"
                },
                {
                    "ecode": "0501401C",
                    "intro": "云端访问被拒绝，如多次尝试失败请联系客服。"
                },
                {
                    "ecode": "0501401D",
                    "intro": "云端访问失败，可能的原因是干扰导致网络不稳定，可移动打印机到路由器附近后重试。"
                },
                {
                    "ecode": "0501401E",
                    "intro": "云端访问返回值非法，如多次尝试失败请联系客服。"
                },
                {
                    "ecode": "0501401F",
                    "intro": "云端绑定授权超时，请检查手机或PC具备访问internet能力，并保证绑定操作时Bmabu Studio/Handy APP在前台执行。"
                },
                {
                    "ecode": "05014020",
                    "intro": "云端访问被拒绝，如多次尝试失败请联系客服。"
                },
                {
                    "ecode": "05014021",
                    "intro": "云端访问失败，可能的原因是干扰导致网络不稳定，可移动打印机到路由器附近后重试。"
                },
                {
                    "ecode": "05014022",
                    "intro": "云端访问返回值非法，如多次尝试失败请联系客服。"
                },
                {
                    "ecode": "05014023",
                    "intro": "云端访问被拒绝，如多次尝试失败请联系客服。"
                },
                {
                    "ecode": "05014024",
                    "intro": "云端访问失败，可能的原因是干扰导致网络不稳定，或不具备internel访问能力， 或路由器防火墙限制。可移动打印机到路由器附近 或检测路由器配置后重试。"
                },
                {
                    "ecode": "05014025",
                    "intro": "云端访问返回值非法，如多次尝试失败请联系客服。"
                },
                {
                    "ecode": "05014026",
                    "intro": "云端访问被拒绝，如多次尝试失败请联系客服。"
                },
                {
                    "ecode": "05014027",
                    "intro": "云端访问失败，可能的原因是干扰导致网络不稳定，可移动打印机到路由器附近后重试。"
                },
                {
                    "ecode": "05014028",
                    "intro": "云端访问返回值非法，如多次尝试失败请联系客服。"
                },
                {
                    "ecode": "05014029",
                    "intro": "云端访问被拒绝，如多次尝试失败请联系客服。"
                },
                {
                    "ecode": "05014031",
                    "intro": "设备发现绑定执行中，屏幕无法展现二维码。可等待局域网绑定结束，或Hand APP/Studio中止绑定，重试扫描屏幕二维码绑定。"
                },
                {
                    "ecode": "05014032",
                    "intro": "二维码绑定执行中，无法进行设备发现绑定。可扫描屏幕二维码绑定，或退出屏幕上二维码页面，尝试设备发现绑定。"
                },
                {
                    "ecode": "03008016",
                    "intro": "检测到挤出机无法挤出料。请根据实际状态，取消本次打印并清理挤出机，或点击“继续打印”按钮恢复打印任务。"
                },
                {
                    "ecode": "05014033",
                    "intro": "打印区区域限制，请在对应区域的商城下载APP，注册后重试绑定。"
                },
                {
                    "ecode": "12008015",
                    "intro": "耗材退出工具头失败，可能是由于耗材卡住，或者断在挤出机或特氟龙管中。"
                },
                {
                    "ecode": "12018015",
                    "intro": "料线从工具头退回失败，请检查料线是否卡住或料线是否断在挤出机内部，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12028015",
                    "intro": "料线从工具头退回失败，请检查料线是否卡住或料线是否断在挤出机内部，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "12038015",
                    "intro": "料线从工具头退回失败，请检查料线是否卡住或料线是否断在挤出机内部，排除异常后点击\"重试\"按钮。"
                },
                {
                    "ecode": "1000C003",
                    "intro": "开启传统模式的延时摄影，可能会产生表面瑕疵，请根据需要启用它？"
                },
                {
                    "ecode": "05014034",
                    "intro": "切片进度长时间没有更新，打印任务退出。请确认参数并重新发起打印。"
                },
                {
                    "ecode": "05014035",
                    "intro": "设备正在进行绑定中，无法响应绑定请求。"
                },
                {
                    "ecode": "1001C001",
                    "intro": "切片参数中开启了旋转花瓶，无法支持延时摄影。"
                },
                {
                    "ecode": "1001C002",
                    "intro": "切片参数中开启了逐件打印，无法支持延时摄影。"
                },
                {
                    "ecode": "05008036",
                    "intro": "切片文件中预设机型与当前打印机型号不一致，是否继续?"
                },
                {
                    "ecode": "05004037",
                    "intro": "切片文件中预设机型与当前打印机型号不兼容，不能进行打印。"
                },
                {
                    "ecode": "05004038",
                    "intro": "切片文件中的喷嘴直径与当前设置不符，不能进行打印。"
                },
                {
                    "ecode": "03008017",
                    "intro": "检测到热床上有异物，请检查并清理后，再点击“继续打印”按钮继续打印。"
                },
                {
                    "ecode": "05014038",
                    "intro": "区域设置与打印机不匹配，请检查打印机的区域设置。"
                },
                {
                    "ecode": "0500403A",
                    "intro": "当前环境温度过低。为了保护您和打印机的安全，打印任务、轴移动等操作将被禁用。请将打印机移动到10度以上的环境使用。"
                },
                {
                    "ecode": "12008016",
                    "intro": "检测到挤出机无法挤出料，请查看HMS帮助。排除异常后，如果打印缺陷可接受，请点击“重试”继续。"
                },
                {
                    "ecode": "12018016",
                    "intro": "检测到挤出机无法挤出料，请查看HMS帮助。排除异常后，如果打印缺陷可接受，请点击“重试”继续。"
                },
                {
                    "ecode": "12028016",
                    "intro": "检测到挤出机无法挤出料，请查看HMS帮助。排除异常后，如果打印缺陷可接受，请点击“重试”继续。"
                },
                {
                    "ecode": "12038016",
                    "intro": "检测到挤出机无法挤出料，请查看HMS帮助。排除异常后，如果打印缺陷可接受，请点击“重试”继续。"
                },
                {
                    "ecode": "03008019",
                    "intro": "没有放置打印板。"
                },
                {
                    "ecode": "03008002",
                    "intro": "激光雷达检测到首层缺陷,请检查打印件状况后决定是否继续。"
                },
                {
                    "ecode": "03008018",
                    "intro": "腔体温控故障。"
                },
                {
                    "ecode": "05144039",
                    "intro": "设备登录过期，请尝试重新绑定。"
                }
            ]
        }
    }
}
